org/posts/c-programming.org
#+TITLE: C
#+DATE: 2026-07-01
#+TAGS: Programming
#+DESCRIPTION: A comprehensive, well-written C programming Q&A guide covering fundamentals, memory model, pointers, systems practices, undefined behavior, tooling, concurrency, performance, portability, and expert engineering workflows.
#+OPTIONS: toc:nil num:nil html-postamble:nil
#+HTML_HEAD: <link rel="stylesheet" href="/static/css/style.css" type="text/css"/>

#+INCLUDE: "../header.org"

* C Programming Q&A (Beginner → Expert)
:PROPERTIES:
:AUTHOR: Revised for readability
:FORMAT: Org mode
:END:

This is an expanded, cleaner, easy-to-read version of your C Q&A.
It keeps your original structure and adds short, practical explanations.

** Beginner Level

*** Q1: What is C?
C is a general-purpose procedural programming language created by Dennis Ritchie at Bell Labs in the early 1970s.

Why it matters:
- Very fast and predictable.
- Gives direct control over memory and data layout.
- Portable across many platforms.
- Forms the foundation for many modern systems.

Where it is used:
- Operating systems and kernels
- Embedded firmware and device drivers
- Compilers/interpreters
- Databases and networking libraries
- High-performance system components

*** Q2: What does a minimal C program look like?
#+begin_src c
#include <stdio.h>

int main(void) {
    printf("Hello, world!\n");
    return 0;
}
#+end_src

Explanation:
- ~#include <stdio.h>~ gives access to ~printf~.
- ~main~ is the entry point.
- ~return 0~ indicates successful execution.

*** Q3: What is the role of ~#include <stdio.h>~?
It provides declarations for standard I/O:
- Output: ~printf~, ~fprintf~, ~snprintf~
- Input: ~scanf~, ~fscanf~, ~fgets~
- Files: ~FILE~, ~fopen~, ~fread~, ~fwrite~, ~fclose~

Without proper declarations, type checking is weaker and bugs become easier.

*** Q4: Declaration vs definition?
- *Declaration*: tells compiler a name/type exists.
  - Example: ~int add(int, int);~
- *Definition*: creates storage or function body.
  - Example: ~int counter = 0;~
  - Example: ~int add(int a, int b) { return a + b; }~

Rule of thumb: every definition is a declaration, but not every declaration is a definition.

*** Q5: Common basic C data types?
- ~char~: small integer, often for text bytes
- ~int~: natural integer size
- ~float~, ~double~: fractional values
- ~void~: no value / generic pointer base

Useful modifiers:
- ~short~, ~long~, ~long long~
- ~signed~, ~unsigned~

When exact width matters, use ~<stdint.h>~ types like ~int32_t~, ~uint64_t~.

*** Q6: How do ~if/else~ and loops work?
#+begin_src c
if (x > 0) { ... } else { ... }

for (int i = 0; i < n; i++) { ... }
while (cond) { ... }
do { ... } while (cond);
#+end_src

- ~if/else~: choose one branch.
- ~for~: best when iteration count is known.
- ~while~: loop while condition remains true.
- ~do...while~: executes at least once.

*** Q7: Difference between ~=~ and ~==~?
- ~=~ assigns value.
- ~==~ compares values.

Accidental assignment in conditions is a classic bug.
Use warnings: ~-Wall -Wextra -Werror~.

*** Q8: What are arrays in C?
Array = contiguous elements of same type.

#+begin_src c
int a[5] = {1,2,3,4,5};
#+end_src

Important:
- Index starts at 0.
- Valid range is ~0..N-1~.
- Out-of-bounds access is undefined behavior.

*** Q9: What is a string in C?
A C string is a ~char~ sequence ending with ~'\0'~.

#+begin_src c
char s[] = "cat";  // {'c','a','t','\0'}
#+end_src

Many string bugs happen when terminator is missing.

*** Q10: What is a function prototype?
A prototype defines function signature before use.

#+begin_src c
int max(int a, int b);
#+end_src

Benefits:
- type checking
- clearer interfaces
- better modularity across files

*** Q11: What is ~sizeof~ and when evaluated?
~sizeof~ returns bytes of a type/expression.

#+begin_src c
sizeof(int);
sizeof x;
#+end_src

- Usually compile-time.
- For VLAs, evaluated at runtime.

*** Q12: Why use ~sizeof *ptr~ in allocation?
#+begin_src c
int *p = malloc(n * sizeof *p);
#+end_src

This avoids mismatches when type changes later.
It is safer during refactors.

*** Q13: What is ~NULL~?
A null pointer constant meaning “points to no valid object/function.”
Used for:
- initialization
- error signaling
- sentinel termination

*** Q14: Why check ~malloc~ return value?
Allocation can fail.
Dereferencing null pointer is undefined behavior.

#+begin_src c
int *p = malloc(n * sizeof *p);
if (!p) { /* handle error */ }
#+end_src

