public/posts/c-programming.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C</title>
<meta name="description" content="A comprehensive, well-written C programming Q&amp;A guide covering fundamentals, memory model, pointers, systems practices, undefined behavior, tooling, concurrency, performance, portability, and expert engineering workflows." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">C</h1>
</header><div class="site-header">
  <div class="site-title"><a href="/">Borislav Dostumski</a></div>
  <nav class="site-nav">
    <a href="/index.html">Index</a>
    <a href="/certificates.html">Certificates</a>
    <a href="/blog.html">Blog</a>
    <a href="/about.html">Bio</a>
  </nav>
</div>
<div id="outline-container-org2e40851" class="outline-2">
<h2 id="org2e40851">C Programming Q&amp;A (Beginner → Expert)</h2>
<div class="outline-text-2" id="text-org2e40851">
<p>
This is an expanded, cleaner, easy-to-read version of your C Q&amp;A.
It keeps your original structure and adds short, practical explanations.
</p>
</div>
<div id="outline-container-orgcaadb11" class="outline-3">
<h3 id="orgcaadb11">Beginner Level</h3>
<div class="outline-text-3" id="text-orgcaadb11">
</div>
<div id="outline-container-org0122230" class="outline-4">
<h4 id="org0122230">Q1: What is C?</h4>
<div class="outline-text-4" id="text-org0122230">
<p>
C is a general-purpose procedural programming language created by Dennis Ritchie at Bell Labs in the early 1970s.
</p>

<p>
Why it matters:
</p>
<ul class="org-ul">
<li>Very fast and predictable.</li>
<li>Gives direct control over memory and data layout.</li>
<li>Portable across many platforms.</li>
<li>Forms the foundation for many modern systems.</li>
</ul>

<p>
Where it is used:
</p>
<ul class="org-ul">
<li>Operating systems and kernels</li>
<li>Embedded firmware and device drivers</li>
<li>Compilers/interpreters</li>
<li>Databases and networking libraries</li>
<li>High-performance system components</li>
</ul>
</div>
</div>
<div id="outline-container-orge81dc7c" class="outline-4">
<h4 id="orge81dc7c">Q2: What does a minimal C program look like?</h4>
<div class="outline-text-4" id="text-orge81dc7c">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdio.h&gt;</span>

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">void</span>) {
    printf(<span style="font-style: italic;">"Hello, world!\n"</span>);
    <span style="font-weight: bold;">return</span> 0;
}
</pre>
</div>

<p>
Explanation:
</p>
<ul class="org-ul">
<li><code>#include &lt;stdio.h&gt;</code> gives access to <code>printf</code>.</li>
<li><code>main</code> is the entry point.</li>
<li><code>return 0</code> indicates successful execution.</li>
</ul>
</div>
</div>
<div id="outline-container-org27daaee" class="outline-4">
<h4 id="org27daaee">Q3: What is the role of <code>#include &lt;stdio.h&gt;</code>?</h4>
<div class="outline-text-4" id="text-org27daaee">
<p>
It provides declarations for standard I/O:
</p>
<ul class="org-ul">
<li>Output: <code>printf</code>, <code>fprintf</code>, <code>snprintf</code></li>
<li>Input: <code>scanf</code>, <code>fscanf</code>, <code>fgets</code></li>
<li>Files: <code>FILE</code>, <code>fopen</code>, <code>fread</code>, <code>fwrite</code>, <code>fclose</code></li>
</ul>

<p>
Without proper declarations, type checking is weaker and bugs become easier.
</p>
</div>
</div>
<div id="outline-container-org7d48f8d" class="outline-4">
<h4 id="org7d48f8d">Q4: Declaration vs definition?</h4>
<div class="outline-text-4" id="text-org7d48f8d">
<ul class="org-ul">
<li><b>Declaration</b>: tells compiler a name/type exists.
<ul class="org-ul">
<li>Example: <code>int add(int, int);</code></li>
</ul></li>
<li><b>Definition</b>: creates storage or function body.
<ul class="org-ul">
<li>Example: <code>int counter = 0;</code></li>
<li>Example: <code>int add(int a, int b) { return a + b; }</code></li>
</ul></li>
</ul>

<p>
Rule of thumb: every definition is a declaration, but not every declaration is a definition.
</p>
</div>
</div>
<div id="outline-container-org68703ed" class="outline-4">
<h4 id="org68703ed">Q5: Common basic C data types?</h4>
<div class="outline-text-4" id="text-org68703ed">
<ul class="org-ul">
<li><code>char</code>: small integer, often for text bytes</li>
<li><code>int</code>: natural integer size</li>
<li><code>float</code>, <code>double</code>: fractional values</li>
<li><code>void</code>: no value / generic pointer base</li>
</ul>

<p>
Useful modifiers:
</p>
<ul class="org-ul">
<li><code>short</code>, <code>long</code>, <code>long long</code></li>
<li><code>signed</code>, <code>unsigned</code></li>
</ul>

<p>
When exact width matters, use <code>&lt;stdint.h&gt;</code> types like <code>int32_t</code>, <code>uint64_t</code>.
</p>
</div>
</div>
<div id="outline-container-org05a1768" class="outline-4">
<h4 id="org05a1768">Q6: How do <code>if/else</code> and loops work?</h4>
<div class="outline-text-4" id="text-org05a1768">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">if</span> (x &gt; 0) { ... } <span style="font-weight: bold;">else</span> { ... }

<span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; n; i++) { ... }
<span style="font-weight: bold;">while</span> (cond) { ... }
<span style="font-weight: bold;">do</span> { ... } <span style="font-weight: bold;">while</span> (cond);
</pre>
</div>

<ul class="org-ul">
<li><code>if/else</code>: choose one branch.</li>
<li><code>for</code>: best when iteration count is known.</li>
<li><code>while</code>: loop while condition remains true.</li>
<li><code>do...while</code>: executes at least once.</li>
</ul>
</div>
</div>
<div id="outline-container-org7a694f3" class="outline-4">
<h4 id="org7a694f3">Q7: Difference between <code>=</code> and <code>==</code>?</h4>
<div class="outline-text-4" id="text-org7a694f3">
<ul class="org-ul">
<li><code>=</code> assigns value.</li>
<li><code>==</code> compares values.</li>
</ul>

<p>
Accidental assignment in conditions is a classic bug.
Use warnings: <code>-Wall -Wextra -Werror</code>.
</p>
</div>
</div>
<div id="outline-container-orgc81e81f" class="outline-4">
<h4 id="orgc81e81f">Q8: What are arrays in C?</h4>
<div class="outline-text-4" id="text-orgc81e81f">
<p>
Array = contiguous elements of same type.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span>[5] = {1,2,3,4,5};
</pre>
</div>

<p>
Important:
</p>
<ul class="org-ul">
<li>Index starts at 0.</li>
<li>Valid range is <code>0..N-1</code>.</li>
<li>Out-of-bounds access is undefined behavior.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd442cf5" class="outline-4">
<h4 id="orgd442cf5">Q9: What is a string in C?</h4>
<div class="outline-text-4" id="text-orgd442cf5">
<p>
A C string is a <code>char</code> sequence ending with <code>'\0'</code>.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">s</span>[] = <span style="font-style: italic;">"cat"</span>;  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">{'c','a','t','\0'}</span>
</pre>
</div>

<p>
Many string bugs happen when terminator is missing.
</p>
</div>
</div>
<div id="outline-container-org7093cbf" class="outline-4">
<h4 id="org7093cbf">Q10: What is a function prototype?</h4>
<div class="outline-text-4" id="text-org7093cbf">
<p>
A prototype defines function signature before use.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">max</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">b</span>);
</pre>
</div>

<p>
Benefits:
</p>
<ul class="org-ul">
<li>type checking</li>
<li>clearer interfaces</li>
<li>better modularity across files</li>
</ul>
</div>
</div>
<div id="outline-container-org3f3df4a" class="outline-4">
<h4 id="org3f3df4a">Q11: What is <code>sizeof</code> and when evaluated?</h4>
<div class="outline-text-4" id="text-org3f3df4a">
<p>
<code>sizeof</code> returns bytes of a type/expression.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">sizeof</span>(<span style="font-weight: bold; text-decoration: underline;">int</span>);
<span style="font-weight: bold;">sizeof</span> x;
</pre>
</div>

<ul class="org-ul">
<li>Usually compile-time.</li>
<li>For VLAs, evaluated at runtime.</li>
</ul>
</div>
</div>
<div id="outline-container-org78f9f6b" class="outline-4">
<h4 id="org78f9f6b">Q12: Why use <code>sizeof *ptr</code> in allocation?</h4>
<div class="outline-text-4" id="text-org78f9f6b">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">p</span> = malloc(n * <span style="font-weight: bold;">sizeof</span> *p);
</pre>
</div>

<p>
This avoids mismatches when type changes later.
It is safer during refactors.
</p>
</div>
</div>
<div id="outline-container-orge1e7bf5" class="outline-4">
<h4 id="orge1e7bf5">Q13: What is <code>NULL</code>?</h4>
<div class="outline-text-4" id="text-orge1e7bf5">
<p>
A null pointer constant meaning “points to no valid object/function.”
Used for:
</p>
<ul class="org-ul">
<li>initialization</li>
<li>error signaling</li>
<li>sentinel termination</li>
</ul>
</div>
</div>
<div id="outline-container-org92ba010" class="outline-4">
<h4 id="org92ba010">Q14: Why check <code>malloc</code> return value?</h4>
<div class="outline-text-4" id="text-org92ba010">
<p>
Allocation can fail.
Dereferencing null pointer is undefined behavior.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">p</span> = malloc(n * <span style="font-weight: bold;">sizeof</span> *p);
<span style="font-weight: bold;">if</span> (!p) { <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">handle error</span><span style="font-weight: bold; font-style: italic;"> */</span> }
</pre>
</div>
</div>
</div>
