org/posts/c-programming.org
*** Q15: ~calloc~ vs ~malloc~?
~calloc(count, size)~:
1. allocates ~count * size~ bytes
2. zero-initializes memory

Great for arrays and state structs needing zero start.

*** Q16: ~realloc~ safety pattern?
If ~realloc~ fails, old pointer remains valid.
Use temporary variable.

#+begin_src c
int *tmp = realloc(p, new_n * sizeof *p);
if (tmp) p = tmp;
else { /* handle failure, old p still valid */ }
#+end_src

*** Q17: Is ~free(NULL)~ safe?
Yes. It is defined as a no-op.

*** Q18: Why is double-free dangerous?
Freeing same block twice is UB.
Can corrupt heap and create security risks.

*** Q19: What is an uninitialized variable?
Automatic local variables have indeterminate values if not initialized.
Reading them is often UB.
Initialize variables when practical.

*** Q20: Local vs global variables?
- Local: block scope, typically automatic lifetime.
- Global: file scope, static storage duration (whole program life).

Use globals carefully to avoid tight coupling.

*** Q21: ~static~ for local variables?
Gives static lifetime but keeps local scope.
Value persists between function calls.

*** Q22: ~static~ at file scope?
For functions/globals, gives internal linkage:
visible only inside that source file.

*** Q23: What does ~extern~ do?
Declares symbol defined elsewhere.
Used for shared declarations across translation units.

*** Q24: What is a header guard?
#+begin_src c
#ifndef MY_H
#define MY_H
/* declarations */
#endif
#+end_src

Prevents duplicate inclusion and redefinition problems.

*** Q25: What is ~#pragma once~?
Common non-standard include-once directive.
Simple and widely supported, but guards are most portable.

*** Q26: Purpose of ~return 0;~ in ~main~?
Signals success to OS.
Non-zero usually indicates error.

*** Q27: What are ~argc~ and ~argv~?
In ~main(int argc, char **argv)~:
- ~argc~ = number of arguments
- ~argv~ = array of argument strings
- ~argv[0]~ usually program name/path

*** Q28: Safe integer parsing from string?
Use ~strtol~, not ~atoi~.

#+begin_src c
char *end = NULL;
errno = 0;
long v = strtol(s, &end, 10);
#+end_src

Validate:
- ~end != s~
- ~*end == '\0'~ (if full parse needed)
- ~errno != ERANGE~

*** Q29: Why avoid ~gets~?
No bounds checking. Unsafe by design.
Removed from modern standards.

*** Q30: ~scanf~ vs ~fgets~?
- ~scanf~: format-driven, easy to misuse.
- ~fgets~: bounded line input, usually safer.

Good pattern: ~fgets~ then parse explicitly.

*** Q31: What is buffer overflow?
Writing beyond object bounds.
Can cause crashes, corruption, vulnerabilities.

*** Q32: Why ~snprintf~ over ~sprintf~?
~snprintf~ includes destination size.
Prevents unbounded writes.

*** Q33: What does ~'\n'~ do?
Adds newline.
On terminals, often triggers line-buffer flush.

*** Q34: Escape sequences?
Examples:
- ~\n~ newline
- ~\t~ tab
- ~\\~ backslash
- ~\"~ double quote
- ~\0~ null terminator

*** Q35: Character literal vs string literal?
- ~'A'~: character constant (integer value)
- ~"A"~: string literal (~'A'~, ~'\0'~)

*** Q36: Can you modify string literal?
No. Writing to it is undefined behavior.

*** Q37: Why ~const char *s = "abc";~?
Expresses immutability and prevents accidental writes.

*** Q38: What is enum used for?
Named integral constants improve readability.

#+begin_src c
enum Color { RED, GREEN, BLUE };
#+end_src

*** Q39: Why use ~size_t~ for sizes?
It is the standard type for sizes/indices and ~sizeof~ results.

*** Q40: What is ~ptrdiff_t~?
Signed type for pointer differences in same array object.

*** Q41: What does casting do?
Explicit conversion request.
Useful but can hide bugs if misused (especially narrowing/sign changes).

*** Q42: Why is implicit conversion risky?
Silent sign/width changes can alter logic unexpectedly.

*** Q43: What is integer promotion?
Small integers (~char~, ~short~) usually promote to ~int~ in expressions.

*** Q44: Signed vs unsigned comparison pitfall?
Mixed comparisons may convert signed to unsigned.

#+begin_src c
int a = -1;
unsigned b = 1;
if (a < b) { /* may be false */ }
#+end_src

