public/posts/c-programming.html
<div id="outline-container-org79a8e1f" class="outline-4">
<h4 id="org79a8e1f">Q15: <code>calloc</code> vs <code>malloc</code>?</h4>
<div class="outline-text-4" id="text-org79a8e1f">
<p>
<code>calloc(count, size)</code>:
</p>
<ol class="org-ol">
<li>allocates <code>count * size</code> bytes</li>
<li>zero-initializes memory</li>
</ol>

<p>
Great for arrays and state structs needing zero start.
</p>
</div>
</div>
<div id="outline-container-org468983f" class="outline-4">
<h4 id="org468983f">Q16: <code>realloc</code> safety pattern?</h4>
<div class="outline-text-4" id="text-org468983f">
<p>
If <code>realloc</code> fails, old pointer remains valid.
Use temporary variable.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">tmp</span> = realloc(p, new_n * <span style="font-weight: bold;">sizeof</span> *p);
<span style="font-weight: bold;">if</span> (tmp) p = tmp;
<span style="font-weight: bold;">else</span> { <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">handle failure, old p still valid</span><span style="font-weight: bold; font-style: italic;"> */</span> }
</pre>
</div>
</div>
</div>
<div id="outline-container-org24b901c" class="outline-4">
<h4 id="org24b901c">Q17: Is <code>free(NULL)</code> safe?</h4>
<div class="outline-text-4" id="text-org24b901c">
<p>
Yes. It is defined as a no-op.
</p>
</div>
</div>
<div id="outline-container-org61411e4" class="outline-4">
<h4 id="org61411e4">Q18: Why is double-free dangerous?</h4>
<div class="outline-text-4" id="text-org61411e4">
<p>
Freeing same block twice is UB.
Can corrupt heap and create security risks.
</p>
</div>
</div>
<div id="outline-container-orgc1efd8e" class="outline-4">
<h4 id="orgc1efd8e">Q19: What is an uninitialized variable?</h4>
<div class="outline-text-4" id="text-orgc1efd8e">
<p>
Automatic local variables have indeterminate values if not initialized.
Reading them is often UB.
Initialize variables when practical.
</p>
</div>
</div>
<div id="outline-container-org0072538" class="outline-4">
<h4 id="org0072538">Q20: Local vs global variables?</h4>
<div class="outline-text-4" id="text-org0072538">
<ul class="org-ul">
<li>Local: block scope, typically automatic lifetime.</li>
<li>Global: file scope, static storage duration (whole program life).</li>
</ul>

<p>
Use globals carefully to avoid tight coupling.
</p>
</div>
</div>
<div id="outline-container-orgb1eb6a0" class="outline-4">
<h4 id="orgb1eb6a0">Q21: <code>static</code> for local variables?</h4>
<div class="outline-text-4" id="text-orgb1eb6a0">
<p>
Gives static lifetime but keeps local scope.
Value persists between function calls.
</p>
</div>
</div>
<div id="outline-container-orgb9121b6" class="outline-4">
<h4 id="orgb9121b6">Q22: <code>static</code> at file scope?</h4>
<div class="outline-text-4" id="text-orgb9121b6">
<p>
For functions/globals, gives internal linkage:
visible only inside that source file.
</p>
</div>
</div>
<div id="outline-container-org1a294ff" class="outline-4">
<h4 id="org1a294ff">Q23: What does <code>extern</code> do?</h4>
<div class="outline-text-4" id="text-org1a294ff">
<p>
Declares symbol defined elsewhere.
Used for shared declarations across translation units.
</p>
</div>
</div>
<div id="outline-container-org234be35" class="outline-4">
<h4 id="org234be35">Q24: What is a header guard?</h4>
<div class="outline-text-4" id="text-org234be35">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">#if</span><span style="font-weight: bold;">n</span><span style="font-weight: bold;">def</span> MY_H
<span style="font-weight: bold;">#define</span> <span style="font-weight: bold; font-style: italic;">MY_H</span>
<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">declarations</span><span style="font-weight: bold; font-style: italic;"> */</span>
<span style="font-weight: bold;">#endif</span>
</pre>
</div>

<p>
Prevents duplicate inclusion and redefinition problems.
</p>
</div>
</div>
<div id="outline-container-org031b2c5" class="outline-4">
<h4 id="org031b2c5">Q25: What is <code>#pragma once</code>?</h4>
<div class="outline-text-4" id="text-org031b2c5">
<p>
Common non-standard include-once directive.
Simple and widely supported, but guards are most portable.
</p>
</div>
</div>
<div id="outline-container-org4d35611" class="outline-4">
<h4 id="org4d35611">Q26: Purpose of <code>return 0;</code> in <code>main</code>?</h4>
<div class="outline-text-4" id="text-org4d35611">
<p>
Signals success to OS.
Non-zero usually indicates error.
</p>
</div>
</div>
<div id="outline-container-org093eaa6" class="outline-4">
<h4 id="org093eaa6">Q27: What are <code>argc</code> and <code>argv</code>?</h4>
<div class="outline-text-4" id="text-org093eaa6">
<p>
In <code>main(int argc, char **argv)</code>:
</p>
<ul class="org-ul">
<li><code>argc</code> = number of arguments</li>
<li><code>argv</code> = array of argument strings</li>
<li><code>argv[0]</code> usually program name/path</li>
</ul>
</div>
</div>
<div id="outline-container-org600f8b4" class="outline-4">
<h4 id="org600f8b4">Q28: Safe integer parsing from string?</h4>
<div class="outline-text-4" id="text-org600f8b4">
<p>
Use <code>strtol</code>, not <code>atoi</code>.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">end</span> = <span style="font-weight: bold; text-decoration: underline;">NULL</span>;
errno = 0;
<span style="font-weight: bold; text-decoration: underline;">long</span> <span style="font-weight: bold; font-style: italic;">v</span> = strtol(s, &amp;end, 10);
</pre>
</div>

<p>
Validate:
</p>
<ul class="org-ul">
<li><code>end != s</code></li>
<li><code>*end == '\0'</code> (if full parse needed)</li>
<li><code>errno != ERANGE</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgac99ab2" class="outline-4">
<h4 id="orgac99ab2">Q29: Why avoid <code>gets</code>?</h4>
<div class="outline-text-4" id="text-orgac99ab2">
<p>
No bounds checking. Unsafe by design.
Removed from modern standards.
</p>
</div>
</div>
<div id="outline-container-orgd00b2d1" class="outline-4">
<h4 id="orgd00b2d1">Q30: <code>scanf</code> vs <code>fgets</code>?</h4>
<div class="outline-text-4" id="text-orgd00b2d1">
<ul class="org-ul">
<li><code>scanf</code>: format-driven, easy to misuse.</li>
<li><code>fgets</code>: bounded line input, usually safer.</li>
</ul>

<p>
Good pattern: <code>fgets</code> then parse explicitly.
</p>
</div>
</div>
<div id="outline-container-orge28d8e1" class="outline-4">
<h4 id="orge28d8e1">Q31: What is buffer overflow?</h4>
<div class="outline-text-4" id="text-orge28d8e1">
<p>
Writing beyond object bounds.
Can cause crashes, corruption, vulnerabilities.
</p>
</div>
</div>
<div id="outline-container-orge143e50" class="outline-4">
<h4 id="orge143e50">Q32: Why <code>snprintf</code> over <code>sprintf</code>?</h4>
<div class="outline-text-4" id="text-orge143e50">
<p>
<code>snprintf</code> includes destination size.
Prevents unbounded writes.
</p>
</div>
</div>
<div id="outline-container-org7fab86e" class="outline-4">
<h4 id="org7fab86e">Q33: What does <code>'\n'</code> do?</h4>
<div class="outline-text-4" id="text-org7fab86e">
<p>
Adds newline.
On terminals, often triggers line-buffer flush.
</p>
</div>
</div>
<div id="outline-container-orgf0e7860" class="outline-4">
<h4 id="orgf0e7860">Q34: Escape sequences?</h4>
<div class="outline-text-4" id="text-orgf0e7860">
<p>
Examples:
</p>
<ul class="org-ul">
<li><code>\n</code> newline</li>
<li><code>\t</code> tab</li>
<li><code>\\</code> backslash</li>
<li><code>\"</code> double quote</li>
<li><code>\0</code> null terminator</li>
</ul>
</div>
</div>
<div id="outline-container-org8d4721c" class="outline-4">
<h4 id="org8d4721c">Q35: Character literal vs string literal?</h4>
<div class="outline-text-4" id="text-org8d4721c">
<ul class="org-ul">
<li><code>'A'</code>: character constant (integer value)</li>
<li><code>"A"</code>: string literal (<code>'A'</code>, <code>'\0'</code>)</li>
</ul>
</div>
</div>
<div id="outline-container-orga9f6846" class="outline-4">
<h4 id="orga9f6846">Q36: Can you modify string literal?</h4>
<div class="outline-text-4" id="text-orga9f6846">
<p>
No. Writing to it is undefined behavior.
</p>
</div>
</div>
<div id="outline-container-org6c4c9e8" class="outline-4">
<h4 id="org6c4c9e8">Q37: Why <code>const char *s = "abc";</code>?</h4>
<div class="outline-text-4" id="text-org6c4c9e8">
<p>
Expresses immutability and prevents accidental writes.
</p>
</div>
</div>
<div id="outline-container-org4aaaaa4" class="outline-4">
<h4 id="org4aaaaa4">Q38: What is enum used for?</h4>
<div class="outline-text-4" id="text-org4aaaaa4">
<p>
Named integral constants improve readability.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">enum</span> <span style="font-weight: bold; text-decoration: underline;">Color</span> { <span style="font-weight: bold; font-style: italic;">RED</span>, <span style="font-weight: bold; font-style: italic;">GREEN</span>, <span style="font-weight: bold; font-style: italic;">BLUE</span> };
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdeb07ea" class="outline-4">
<h4 id="orgdeb07ea">Q39: Why use <code>size_t</code> for sizes?</h4>
<div class="outline-text-4" id="text-orgdeb07ea">
<p>
It is the standard type for sizes/indices and <code>sizeof</code> results.
</p>
</div>
</div>
<div id="outline-container-orgb7688a4" class="outline-4">
<h4 id="orgb7688a4">Q40: What is <code>ptrdiff_t</code>?</h4>
<div class="outline-text-4" id="text-orgb7688a4">
<p>
Signed type for pointer differences in same array object.
</p>
</div>
</div>
<div id="outline-container-org555076b" class="outline-4">
<h4 id="org555076b">Q41: What does casting do?</h4>
<div class="outline-text-4" id="text-org555076b">
<p>
Explicit conversion request.
Useful but can hide bugs if misused (especially narrowing/sign changes).
</p>
</div>
</div>
<div id="outline-container-orgae13c9f" class="outline-4">
<h4 id="orgae13c9f">Q42: Why is implicit conversion risky?</h4>
<div class="outline-text-4" id="text-orgae13c9f">
<p>
Silent sign/width changes can alter logic unexpectedly.
</p>
</div>
</div>
<div id="outline-container-org0cb582a" class="outline-4">
<h4 id="org0cb582a">Q43: What is integer promotion?</h4>
<div class="outline-text-4" id="text-org0cb582a">
<p>
Small integers (<code>char</code>, <code>short</code>) usually promote to <code>int</code> in expressions.
</p>
</div>
</div>
<div id="outline-container-orgb8e5a48" class="outline-4">
<h4 id="orgb8e5a48">Q44: Signed vs unsigned comparison pitfall?</h4>
<div class="outline-text-4" id="text-orgb8e5a48">
<p>
Mixed comparisons may convert signed to unsigned.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span> = -1;
<span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; font-style: italic;">b</span> = 1;
<span style="font-weight: bold;">if</span> (a &lt; b) { <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">may be false</span><span style="font-weight: bold; font-style: italic;"> */</span> }
</pre>
</div>
</div>
</div>
