org/posts/c-programming.org
*** Q45: Bitwise operators?
- ~&~ AND
- ~|~ OR
- ~^~ XOR
- ~~~ NOT
- ~<<~ shift left
- ~>>~ shift right

Common in flags, protocols, device code.

*** Q46: Logical vs bitwise operators?
- Logical: ~&&~, ~||~, ~!~ (truth values, short-circuit)
- Bitwise: bit-level integer ops

*** Q47: Short-circuit evaluation?
Right side only evaluated if needed.

#+begin_src c
if (p && p->next) { ... }
#+end_src

*** Q48: Operator precedence?
Rules for grouping expressions.
Still, prefer parentheses for clarity.

*** Q49: Why add parentheses anyway?
Improves readability and avoids maintenance mistakes.

*** Q50: What is ternary operator?
Compact conditional expression.

#+begin_src c
result = cond ? a : b;
#+end_src

Great for simple value choices.

** Intermediate Level

*** Q51: What is a pointer?
A variable holding an address.

#+begin_src c
int x = 10;
int *p = &x;
#+end_src

Pointers enable indirection and efficient interfaces.

*** Q52: ~*~ vs ~&~ with pointers?
- ~&x~ → address of ~x~
- ~*p~ → value at address in ~p~

*** Q53: Pointer arithmetic?
Moves in element units, not raw bytes.

#+begin_src c
int a[3] = {10,20,30};
int *p = a;
p++; // now points to a[1]
#+end_src

Valid only within same array object (or one-past-end).

*** Q54: Array name vs pointer?
Related, not identical:
- array often decays to pointer in expressions
- array itself has fixed size and is not assignable

*** Q55: Pointer to pointer?
#+begin_src c
int x = 1;
int *p = &x;
int **pp = &p;
#+end_src

Useful when a function must modify caller pointer.

*** Q56: Why pass pointer-to-pointer?
To allocate/replace caller-owned pointer or linked-list head safely.

*** Q57: How are 2D arrays stored?
For ~T a[R][C]~, memory is contiguous row-major.

*** Q58: ~int **~ vs ~int (*)[C]~?
Not interchangeable:
- ~int **~: pointer to pointer (often non-contiguous rows)
- ~int (*)[C]~: pointer to row of fixed width ~C~

*** Q59: What are VLAs?
Runtime-sized automatic arrays.
Standardized in C99, later optional. Support varies.

*** Q60: Are VLAs recommended for portability?
Often avoided for portable/safety code due to optional support and stack risk.

*** Q61: Dynamic memory allocation?
Use ~malloc~, ~calloc~, ~realloc~, and release with ~free~.

*** Q62: What causes memory leaks?
Losing all references to allocated memory before freeing it.

*** Q63: What are dangling pointers?
Pointers to freed/out-of-scope memory.

#+begin_src c
free(p);
p = NULL;
#+end_src

*** Q64: Flexible array member?
#+begin_src c
struct Buf { size_t n; char data[]; };
#+end_src

Last member only; supports variable-size tail payload.

*** Q65: Allocate struct with flexible array?
#+begin_src c
size_t n = 100;
struct Buf *b = malloc(sizeof *b + n * sizeof b->data[0]);
#+end_src

*** Q66: ~memcpy~ vs ~memmove~?
- ~memcpy~: no overlap allowed
- ~memmove~: overlap-safe

*** Q67: What does ~memcmp~ return?
<0, 0, >0 based on lexicographic byte comparison.

*** Q68: Why ~strncpy~ can be tricky?
May not NUL-terminate on truncation and may pad unnecessary zeros.

*** Q69: Safer string copy pattern?
#+begin_src c
snprintf(dst, dst_sz, "%s", src);
#+end_src

Or explicit bounded copy with forced terminator.

*** Q70: What is ~errno~?
Thread-local error indicator set by many library/system calls.

*** Q71: Reset ~errno = 0~ before ambiguous APIs?
Yes, especially for ~strtol~/~strtod~ families.

*** Q72: Human-readable ~errno~?
#+begin_src c
fprintf(stderr, "%s\n", strerror(errno));
#+end_src

*** Q73: What is EOF?
Special ~int~ sentinel indicating end-of-file or error in stdio reads.

*** Q74: Why store ~fgetc~ result in ~int~?
Must represent all byte values plus ~EOF~.

*** Q75: Text vs binary mode?
Text mode may translate newlines on some OSes.
Binary mode is raw bytes.

