public/posts/c-programming.html
<div id="outline-container-org2abf58e" class="outline-4">
<h4 id="org2abf58e">Q45: Bitwise operators?</h4>
<div class="outline-text-4" id="text-org2abf58e">
<ul class="org-ul">
<li><code>&amp;</code> AND</li>
<li><code>|</code> OR</li>
<li><code>^</code> XOR</li>
<li><code>~</code> NOT</li>
<li><code>&lt;&lt;</code> shift left</li>
<li><code>&gt;&gt;</code> shift right</li>
</ul>

<p>
Common in flags, protocols, device code.
</p>
</div>
</div>
<div id="outline-container-orgab61cca" class="outline-4">
<h4 id="orgab61cca">Q46: Logical vs bitwise operators?</h4>
<div class="outline-text-4" id="text-orgab61cca">
<ul class="org-ul">
<li>Logical: <code>&amp;&amp;</code>, <code>||</code>, <code>!</code> (truth values, short-circuit)</li>
<li>Bitwise: bit-level integer ops</li>
</ul>
</div>
</div>
<div id="outline-container-org1bc2e12" class="outline-4">
<h4 id="org1bc2e12">Q47: Short-circuit evaluation?</h4>
<div class="outline-text-4" id="text-org1bc2e12">
<p>
Right side only evaluated if needed.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">if</span> (p &amp;&amp; p-&gt;next) { ... }
</pre>
</div>
</div>
</div>
<div id="outline-container-org59cdca0" class="outline-4">
<h4 id="org59cdca0">Q48: Operator precedence?</h4>
<div class="outline-text-4" id="text-org59cdca0">
<p>
Rules for grouping expressions.
Still, prefer parentheses for clarity.
</p>
</div>
</div>
<div id="outline-container-org77367d1" class="outline-4">
<h4 id="org77367d1">Q49: Why add parentheses anyway?</h4>
<div class="outline-text-4" id="text-org77367d1">
<p>
Improves readability and avoids maintenance mistakes.
</p>
</div>
</div>
<div id="outline-container-org0f2b52f" class="outline-4">
<h4 id="org0f2b52f">Q50: What is ternary operator?</h4>
<div class="outline-text-4" id="text-org0f2b52f">
<p>
Compact conditional expression.
</p>

<div class="org-src-container">
<pre class="src src-c">result = cond ? a : b;
</pre>
</div>

<p>
Great for simple value choices.
</p>
</div>
</div>
</div>
<div id="outline-container-org8fdd592" class="outline-3">
<h3 id="org8fdd592">Intermediate Level</h3>
<div class="outline-text-3" id="text-org8fdd592">
</div>
<div id="outline-container-org314ef6e" class="outline-4">
<h4 id="org314ef6e">Q51: What is a pointer?</h4>
<div class="outline-text-4" id="text-org314ef6e">
<p>
A variable holding an address.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span> = 10;
<span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">p</span> = &amp;x;
</pre>
</div>

<p>
Pointers enable indirection and efficient interfaces.
</p>
</div>
</div>
<div id="outline-container-org3a2a78c" class="outline-4">
<h4 id="org3a2a78c">Q52: <code>*</code> vs <code>&amp;</code> with pointers?</h4>
<div class="outline-text-4" id="text-org3a2a78c">
<ul class="org-ul">
<li><code>&amp;x</code> → address of <code>x</code></li>
<li><code>*p</code> → value at address in <code>p</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgb2e9f85" class="outline-4">
<h4 id="orgb2e9f85">Q53: Pointer arithmetic?</h4>
<div class="outline-text-4" id="text-orgb2e9f85">
<p>
Moves in element units, not raw bytes.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span>[3] = {10,20,30};
<span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">p</span> = a;
p++; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">now points to a[1]</span>
</pre>
</div>

<p>
Valid only within same array object (or one-past-end).
</p>
</div>
</div>
<div id="outline-container-orge8ec9ec" class="outline-4">
<h4 id="orge8ec9ec">Q54: Array name vs pointer?</h4>
<div class="outline-text-4" id="text-orge8ec9ec">
<p>
Related, not identical:
</p>
<ul class="org-ul">
<li>array often decays to pointer in expressions</li>
<li>array itself has fixed size and is not assignable</li>
</ul>
</div>
</div>
<div id="outline-container-orgbb93290" class="outline-4">
<h4 id="orgbb93290">Q55: Pointer to pointer?</h4>
<div class="outline-text-4" id="text-orgbb93290">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span> = 1;
<span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">p</span> = &amp;x;
<span style="font-weight: bold; text-decoration: underline;">int</span> **<span style="font-weight: bold; font-style: italic;">pp</span> = &amp;p;
</pre>
</div>

<p>
Useful when a function must modify caller pointer.
</p>
</div>
</div>
<div id="outline-container-orgb35ccf0" class="outline-4">
<h4 id="orgb35ccf0">Q56: Why pass pointer-to-pointer?</h4>
<div class="outline-text-4" id="text-orgb35ccf0">
<p>
To allocate/replace caller-owned pointer or linked-list head safely.
</p>
</div>
</div>
<div id="outline-container-org226cb2a" class="outline-4">
<h4 id="org226cb2a">Q57: How are 2D arrays stored?</h4>
<div class="outline-text-4" id="text-org226cb2a">
<p>
For <code>T a[R][C]</code>, memory is contiguous row-major.
</p>
</div>
</div>
<div id="outline-container-orge84dc2f" class="outline-4">
<h4 id="orge84dc2f">Q58: <code>int **</code> vs <code>int (*)[C]</code>?</h4>
<div class="outline-text-4" id="text-orge84dc2f">
<p>
Not interchangeable:
</p>
<ul class="org-ul">
<li><code>int **</code>: pointer to pointer (often non-contiguous rows)</li>
<li><code>int (*)[C]</code>: pointer to row of fixed width <code>C</code></li>
</ul>
</div>
</div>
<div id="outline-container-org71d6e08" class="outline-4">
<h4 id="org71d6e08">Q59: What are VLAs?</h4>
<div class="outline-text-4" id="text-org71d6e08">
<p>
Runtime-sized automatic arrays.
Standardized in C99, later optional. Support varies.
</p>
</div>
</div>
<div id="outline-container-orgaa1c5ab" class="outline-4">
<h4 id="orgaa1c5ab">Q60: Are VLAs recommended for portability?</h4>
<div class="outline-text-4" id="text-orgaa1c5ab">
<p>
Often avoided for portable/safety code due to optional support and stack risk.
</p>
</div>
</div>
<div id="outline-container-org6b13e6e" class="outline-4">
<h4 id="org6b13e6e">Q61: Dynamic memory allocation?</h4>
<div class="outline-text-4" id="text-org6b13e6e">
<p>
Use <code>malloc</code>, <code>calloc</code>, <code>realloc</code>, and release with <code>free</code>.
</p>
</div>
</div>
<div id="outline-container-org9077f22" class="outline-4">
<h4 id="org9077f22">Q62: What causes memory leaks?</h4>
<div class="outline-text-4" id="text-org9077f22">
<p>
Losing all references to allocated memory before freeing it.
</p>
</div>
</div>
<div id="outline-container-org96130d4" class="outline-4">
<h4 id="org96130d4">Q63: What are dangling pointers?</h4>
<div class="outline-text-4" id="text-org96130d4">
<p>
Pointers to freed/out-of-scope memory.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">free</span>(p);
p = <span style="font-weight: bold; text-decoration: underline;">NULL</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb796f11" class="outline-4">
<h4 id="orgb796f11">Q64: Flexible array member?</h4>
<div class="outline-text-4" id="text-orgb796f11">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">Buf</span> { <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">n</span>; <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">data</span>[]; };
</pre>
</div>

<p>
Last member only; supports variable-size tail payload.
</p>
</div>
</div>
<div id="outline-container-org33e7def" class="outline-4">
<h4 id="org33e7def">Q65: Allocate struct with flexible array?</h4>
<div class="outline-text-4" id="text-org33e7def">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">n</span> = 100;
<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">Buf</span> *<span style="font-weight: bold; font-style: italic;">b</span> = malloc(<span style="font-weight: bold;">sizeof</span> *b + n * <span style="font-weight: bold;">sizeof</span> b-&gt;data[0]);
</pre>
</div>
</div>
</div>
<div id="outline-container-org4c634aa" class="outline-4">
<h4 id="org4c634aa">Q66: <code>memcpy</code> vs <code>memmove</code>?</h4>
<div class="outline-text-4" id="text-org4c634aa">
<ul class="org-ul">
<li><code>memcpy</code>: no overlap allowed</li>
<li><code>memmove</code>: overlap-safe</li>
</ul>
</div>
</div>
<div id="outline-container-orgbd8b0c9" class="outline-4">
<h4 id="orgbd8b0c9">Q67: What does <code>memcmp</code> return?</h4>
<div class="outline-text-4" id="text-orgbd8b0c9">
<p>
&lt;0, 0, &gt;0 based on lexicographic byte comparison.
</p>
</div>
</div>
<div id="outline-container-org7408ec6" class="outline-4">
<h4 id="org7408ec6">Q68: Why <code>strncpy</code> can be tricky?</h4>
<div class="outline-text-4" id="text-org7408ec6">
<p>
May not NUL-terminate on truncation and may pad unnecessary zeros.
</p>
</div>
</div>
<div id="outline-container-org7d0b236" class="outline-4">
<h4 id="org7d0b236">Q69: Safer string copy pattern?</h4>
<div class="outline-text-4" id="text-org7d0b236">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">snprintf</span>(dst, dst_sz, <span style="font-style: italic;">"%s"</span>, src);
</pre>
</div>

<p>
Or explicit bounded copy with forced terminator.
</p>
</div>
</div>
<div id="outline-container-orgc30b5d1" class="outline-4">
<h4 id="orgc30b5d1">Q70: What is <code>errno</code>?</h4>
<div class="outline-text-4" id="text-orgc30b5d1">
<p>
Thread-local error indicator set by many library/system calls.
</p>
</div>
</div>
<div id="outline-container-orga55a026" class="outline-4">
<h4 id="orga55a026">Q71: Reset <code>errno = 0</code> before ambiguous APIs?</h4>
<div class="outline-text-4" id="text-orga55a026">
<p>
Yes, especially for <code>strtol~/~strtod</code> families.
</p>
</div>
</div>
<div id="outline-container-org39e5930" class="outline-4">
<h4 id="org39e5930">Q72: Human-readable <code>errno</code>?</h4>
<div class="outline-text-4" id="text-org39e5930">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">fprintf</span>(stderr, <span style="font-style: italic;">"%s\n"</span>, <span style="font-weight: bold; text-decoration: underline;">strerror</span>(<span style="font-weight: bold; font-style: italic;">errno</span>));
</pre>
</div>
</div>
</div>
<div id="outline-container-org1f0804d" class="outline-4">
<h4 id="org1f0804d">Q73: What is EOF?</h4>
<div class="outline-text-4" id="text-org1f0804d">
<p>
Special <code>int</code> sentinel indicating end-of-file or error in stdio reads.
</p>
</div>
</div>
<div id="outline-container-org22e714a" class="outline-4">
<h4 id="org22e714a">Q74: Why store <code>fgetc</code> result in <code>int</code>?</h4>
<div class="outline-text-4" id="text-org22e714a">
<p>
Must represent all byte values plus <code>EOF</code>.
</p>
</div>
</div>
<div id="outline-container-orgc8205b7" class="outline-4">
<h4 id="orgc8205b7">Q75: Text vs binary mode?</h4>
<div class="outline-text-4" id="text-orgc8205b7">
<p>
Text mode may translate newlines on some OSes.
Binary mode is raw bytes.
</p>
</div>
</div>
