org/posts/c-programming.org
*** Q76: Open file safely?
#+begin_src c
FILE *fp = fopen(path, "rb");
if (!fp) { /* handle */ }
#+end_src

Always check and close on all paths.

*** Q77: Why check I/O return values?
I/O can fail partially or fully (permissions, disk full, interruption).

*** Q78: What does ~fflush~ do?
Flushes stdio output buffers to OS handle.
Not guaranteed physical disk persistence.

*** Q79: Is ~fflush(stdin)~ valid?
No, undefined behavior in standard C.

*** Q80: CLI parsing best practices?
- validate count/formats
- parse robustly
- enforce bounds
- provide clear usage/help

*** Q81: Defensive programming in C?
Assume failures happen.
Validate inputs, check returns, preserve invariants.

*** Q82: Preconditions and postconditions?
- Preconditions: caller requirements
- Postconditions: function guarantees after success

*** Q83: Why separate ~.h~ and ~.c~?
Improves modularity, encapsulation, maintainability, and build organization.

*** Q84: What belongs in headers?
Public declarations:
- exposed types
- constants/macros
- function prototypes
- ownership/contracts docs

*** Q85: Function definitions in headers?
Usually avoid.
Exception: ~static inline~ or macro utilities.

*** Q86: Why hide struct internals?
Preserves API/ABI flexibility and encapsulation.

*** Q87: Opaque pointer pattern?
#+begin_src c
typedef struct Foo Foo;
Foo *foo_create(void);
void foo_destroy(Foo *);
#+end_src

Implementation details stay private in source file.

*** Q88: Callback context pointer (~void *ctx~)?
User data passed through callback chain.
Avoids globals and improves reuse.

*** Q89: Robust callback signature design?
- explicit arguments
- const-correctness
- documented ownership/lifetime
- clear return conventions

*** Q90: What is ownership in API design?
Defines who allocates, who frees, and when transfer happens.
Clear ownership prevents leaks/UAF bugs.

*** Q91: Naming ownership transfer?
Use consistent pairs:
- ~create/destroy~
- ~new/free~
- ~dup/free~
- ~take/give~

*** Q92: What is idempotent cleanup?
Cleanup safe to call multiple times without breaking state.

*** Q93: Why set pointer NULL after free?
Avoids accidental reuse and makes repeat cleanup safer.

*** Q94: Sentinel value?
Special marker for boundary/error/termination (e.g., ~NULL~, ~-1~).

*** Q95: Magic numbers?
Unexplained literals reduce clarity.
Prefer named constants/enums.

*** Q96: What is a struct?
#+begin_src c
struct Point { int x; int y; };
struct Point p = {3, 4};
#+end_src

Groups related fields as one type.

*** Q97: What is typedef for?
Type aliases improve readability and abstraction.

*** Q98: Pass-by-value vs pointers?
C is pass-by-value only.
Use pointers to allow function to modify caller data.

*** Q99: What is a translation unit?
A source file after preprocessing.
Each TU compiles separately, then linker resolves symbols.

*** Q100: Build phases in C?
1. Preprocessing
2. Compilation
3. Assembling
4. Linking

** Quick Best-Practice Add-on (Useful Summary)

- Compile with strong warnings: ~-Wall -Wextra -Wpedantic~
- Treat warnings as errors in CI: ~-Werror~
- Prefer ~fgets~ + explicit parse for user input
- Check every allocation and I/O return value
- Document ownership for every pointer-returning API
- Keep headers minimal and stable
- Use ~const~ aggressively for intent and safety
- Avoid undefined behavior even if “it works on my machine”

** One-line takeaway
C gives powerful control and performance, but correctness depends on disciplined memory handling, strict input validation, and clear API contracts.

* C Programming Q&A (Advanced + Expert, Expanded)

** Advanced Level

*** Q101: What is undefined behavior (UB)?
Undefined behavior means the C standard imposes no requirements on what happens.
If your program triggers UB, *anything* can happen: crash, wrong output, or seemingly correct behavior.
Compilers may optimize under the assumption UB never occurs.
Examples: out-of-bounds access, signed overflow, use-after-free, unsequenced modifications.

*** Q102: What is implementation-defined behavior?
Implementation-defined behavior is behavior where the compiler/platform must choose one valid option and document it.
Your program is still valid C, but result may differ across implementations.
Examples: size of ~int~, signed integer representation details, right-shift behavior for negative signed integers.

