public/posts/c-programming.html
<div id="outline-container-org14de912" class="outline-4">
<h4 id="org14de912">Q76: Open file safely?</h4>
<div class="outline-text-4" id="text-org14de912">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">FILE</span> *<span style="font-weight: bold; font-style: italic;">fp</span> = fopen(path, <span style="font-style: italic;">"rb"</span>);
<span style="font-weight: bold;">if</span> (!fp) { <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">handle</span><span style="font-weight: bold; font-style: italic;"> */</span> }
</pre>
</div>

<p>
Always check and close on all paths.
</p>
</div>
</div>
<div id="outline-container-orgd842fd2" class="outline-4">
<h4 id="orgd842fd2">Q77: Why check I/O return values?</h4>
<div class="outline-text-4" id="text-orgd842fd2">
<p>
I/O can fail partially or fully (permissions, disk full, interruption).
</p>
</div>
</div>
<div id="outline-container-org58253ab" class="outline-4">
<h4 id="org58253ab">Q78: What does <code>fflush</code> do?</h4>
<div class="outline-text-4" id="text-org58253ab">
<p>
Flushes stdio output buffers to OS handle.
Not guaranteed physical disk persistence.
</p>
</div>
</div>
<div id="outline-container-org5a5e251" class="outline-4">
<h4 id="org5a5e251">Q79: Is <code>fflush(stdin)</code> valid?</h4>
<div class="outline-text-4" id="text-org5a5e251">
<p>
No, undefined behavior in standard C.
</p>
</div>
</div>
<div id="outline-container-org3d33309" class="outline-4">
<h4 id="org3d33309">Q80: CLI parsing best practices?</h4>
<div class="outline-text-4" id="text-org3d33309">
<ul class="org-ul">
<li>validate count/formats</li>
<li>parse robustly</li>
<li>enforce bounds</li>
<li>provide clear usage/help</li>
</ul>
</div>
</div>
<div id="outline-container-orgcd236c1" class="outline-4">
<h4 id="orgcd236c1">Q81: Defensive programming in C?</h4>
<div class="outline-text-4" id="text-orgcd236c1">
<p>
Assume failures happen.
Validate inputs, check returns, preserve invariants.
</p>
</div>
</div>
<div id="outline-container-orge63efc2" class="outline-4">
<h4 id="orge63efc2">Q82: Preconditions and postconditions?</h4>
<div class="outline-text-4" id="text-orge63efc2">
<ul class="org-ul">
<li>Preconditions: caller requirements</li>
<li>Postconditions: function guarantees after success</li>
</ul>
</div>
</div>
<div id="outline-container-orge3ec33b" class="outline-4">
<h4 id="orge3ec33b">Q83: Why separate <code>.h</code> and <code>.c</code>?</h4>
<div class="outline-text-4" id="text-orge3ec33b">
<p>
Improves modularity, encapsulation, maintainability, and build organization.
</p>
</div>
</div>
<div id="outline-container-org2d48647" class="outline-4">
<h4 id="org2d48647">Q84: What belongs in headers?</h4>
<div class="outline-text-4" id="text-org2d48647">
<p>
Public declarations:
</p>
<ul class="org-ul">
<li>exposed types</li>
<li>constants/macros</li>
<li>function prototypes</li>
<li>ownership/contracts docs</li>
</ul>
</div>
</div>
<div id="outline-container-orgfb41d7d" class="outline-4">
<h4 id="orgfb41d7d">Q85: Function definitions in headers?</h4>
<div class="outline-text-4" id="text-orgfb41d7d">
<p>
Usually avoid.
Exception: <code>static inline</code> or macro utilities.
</p>
</div>
</div>
<div id="outline-container-org8d8f9f1" class="outline-4">
<h4 id="org8d8f9f1">Q86: Why hide struct internals?</h4>
<div class="outline-text-4" id="text-org8d8f9f1">
<p>
Preserves API/ABI flexibility and encapsulation.
</p>
</div>
</div>
<div id="outline-container-orgbe177ff" class="outline-4">
<h4 id="orgbe177ff">Q87: Opaque pointer pattern?</h4>
<div class="outline-text-4" id="text-orgbe177ff">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">typedef</span> <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">Foo</span> <span style="font-weight: bold; text-decoration: underline;">Foo</span>;
<span style="font-weight: bold; text-decoration: underline;">Foo</span> *<span style="font-weight: bold;">foo_create</span>(<span style="font-weight: bold; text-decoration: underline;">void</span>);
<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">foo_destroy</span>(<span style="font-weight: bold; text-decoration: underline;">Foo</span> *);
</pre>
</div>

<p>
Implementation details stay private in source file.
</p>
</div>
</div>
<div id="outline-container-org02816d6" class="outline-4">
<h4 id="org02816d6">Q88: Callback context pointer (<code>void *ctx</code>)?</h4>
<div class="outline-text-4" id="text-org02816d6">
<p>
User data passed through callback chain.
Avoids globals and improves reuse.
</p>
</div>
</div>
<div id="outline-container-org3a3b139" class="outline-4">
<h4 id="org3a3b139">Q89: Robust callback signature design?</h4>
<div class="outline-text-4" id="text-org3a3b139">
<ul class="org-ul">
<li>explicit arguments</li>
<li>const-correctness</li>
<li>documented ownership/lifetime</li>
<li>clear return conventions</li>
</ul>
</div>
</div>
<div id="outline-container-org5952f05" class="outline-4">
<h4 id="org5952f05">Q90: What is ownership in API design?</h4>
<div class="outline-text-4" id="text-org5952f05">
<p>
Defines who allocates, who frees, and when transfer happens.
Clear ownership prevents leaks/UAF bugs.
</p>
</div>
</div>
<div id="outline-container-org420c6b7" class="outline-4">
<h4 id="org420c6b7">Q91: Naming ownership transfer?</h4>
<div class="outline-text-4" id="text-org420c6b7">
<p>
Use consistent pairs:
</p>
<ul class="org-ul">
<li><code>create/destroy</code></li>
<li><code>new/free</code></li>
<li><code>dup/free</code></li>
<li><code>take/give</code></li>
</ul>
</div>
</div>
<div id="outline-container-org75bbf5e" class="outline-4">
<h4 id="org75bbf5e">Q92: What is idempotent cleanup?</h4>
<div class="outline-text-4" id="text-org75bbf5e">
<p>
Cleanup safe to call multiple times without breaking state.
</p>
</div>
</div>
<div id="outline-container-org6136b31" class="outline-4">
<h4 id="org6136b31">Q93: Why set pointer NULL after free?</h4>
<div class="outline-text-4" id="text-org6136b31">
<p>
Avoids accidental reuse and makes repeat cleanup safer.
</p>
</div>
</div>
<div id="outline-container-orge397423" class="outline-4">
<h4 id="orge397423">Q94: Sentinel value?</h4>
<div class="outline-text-4" id="text-orge397423">
<p>
Special marker for boundary/error/termination (e.g., <code>NULL</code>, <code>-1</code>).
</p>
</div>
</div>
<div id="outline-container-org2ba699e" class="outline-4">
<h4 id="org2ba699e">Q95: Magic numbers?</h4>
<div class="outline-text-4" id="text-org2ba699e">
<p>
Unexplained literals reduce clarity.
Prefer named constants/enums.
</p>
</div>
</div>
<div id="outline-container-org9b8d94f" class="outline-4">
<h4 id="org9b8d94f">Q96: What is a struct?</h4>
<div class="outline-text-4" id="text-org9b8d94f">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">Point</span> { <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">x</span>; <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">y</span>; };
<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">Point</span> <span style="font-weight: bold; font-style: italic;">p</span> = {3, 4};
</pre>
</div>

<p>
Groups related fields as one type.
</p>
</div>
</div>
<div id="outline-container-orge989c61" class="outline-4">
<h4 id="orge989c61">Q97: What is typedef for?</h4>
<div class="outline-text-4" id="text-orge989c61">
<p>
Type aliases improve readability and abstraction.
</p>
</div>
</div>
<div id="outline-container-orgf9e41a4" class="outline-4">
<h4 id="orgf9e41a4">Q98: Pass-by-value vs pointers?</h4>
<div class="outline-text-4" id="text-orgf9e41a4">
<p>
C is pass-by-value only.
Use pointers to allow function to modify caller data.
</p>
</div>
</div>
<div id="outline-container-orga308929" class="outline-4">
<h4 id="orga308929">Q99: What is a translation unit?</h4>
<div class="outline-text-4" id="text-orga308929">
<p>
A source file after preprocessing.
Each TU compiles separately, then linker resolves symbols.
</p>
</div>
</div>
<div id="outline-container-org2ef1612" class="outline-4">
<h4 id="org2ef1612">Q100: Build phases in C?</h4>
<div class="outline-text-4" id="text-org2ef1612">
<ol class="org-ol">
<li>Preprocessing</li>
<li>Compilation</li>
<li>Assembling</li>
<li>Linking</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org814301d" class="outline-3">
<h3 id="org814301d">Quick Best-Practice Add-on (Useful Summary)</h3>
<div class="outline-text-3" id="text-org814301d">
<ul class="org-ul">
<li>Compile with strong warnings: <code>-Wall -Wextra -Wpedantic</code></li>
<li>Treat warnings as errors in CI: <code>-Werror</code></li>
<li>Prefer <code>fgets</code> + explicit parse for user input</li>
<li>Check every allocation and I/O return value</li>
<li>Document ownership for every pointer-returning API</li>
<li>Keep headers minimal and stable</li>
<li>Use <code>const</code> aggressively for intent and safety</li>
<li>Avoid undefined behavior even if “it works on my machine”</li>
</ul>
</div>
</div>
<div id="outline-container-org1318290" class="outline-3">
<h3 id="org1318290">One-line takeaway</h3>
<div class="outline-text-3" id="text-org1318290">
<p>
C gives powerful control and performance, but correctness depends on disciplined memory handling, strict input validation, and clear API contracts.
</p>
</div>
</div>
</div>
<div id="outline-container-org2d0b291" class="outline-2">
<h2 id="org2d0b291">C Programming Q&amp;A (Advanced + Expert, Expanded)</h2>
<div class="outline-text-2" id="text-org2d0b291">
</div>
<div id="outline-container-org49ce7b2" class="outline-3">
<h3 id="org49ce7b2">Advanced Level</h3>
<div class="outline-text-3" id="text-org49ce7b2">
</div>
<div id="outline-container-org38e8bb2" class="outline-4">
<h4 id="org38e8bb2">Q101: What is undefined behavior (UB)?</h4>
<div class="outline-text-4" id="text-org38e8bb2">
<p>
Undefined behavior means the C standard imposes no requirements on what happens.
If your program triggers UB, <b>anything</b> can happen: crash, wrong output, or seemingly correct behavior.
Compilers may optimize under the assumption UB never occurs.
Examples: out-of-bounds access, signed overflow, use-after-free, unsequenced modifications.
</p>
</div>
</div>
<div id="outline-container-org0945166" class="outline-4">
<h4 id="org0945166">Q102: What is implementation-defined behavior?</h4>
<div class="outline-text-4" id="text-org0945166">
<p>
Implementation-defined behavior is behavior where the compiler/platform must choose one valid option and document it.
Your program is still valid C, but result may differ across implementations.
Examples: size of <code>int</code>, signed integer representation details, right-shift behavior for negative signed integers.
</p>
</div>
</div>
