org/posts/c-programming.org
*** Q103: What is strict aliasing?
Strict aliasing is an optimization rule: an object should be accessed through a compatible type (with limited exceptions).
Violating this rule is UB and may break code under optimization.
Portable alternatives for type reinterpretation usually involve ~memcpy~.

*** Q104: What is the volatile qualifier?
~volatile~ tells the compiler that reads/writes to an object are observable side effects and must not be optimized away or merged too aggressively.
Typical use: memory-mapped I/O registers, signal-updated flags.
It does *not* make operations atomic or thread-safe.

*** Q105: Is volatile enough for thread synchronization?
No. ~volatile~ does not provide mutual exclusion, atomicity, or inter-thread ordering guarantees.
Use C11 atomics (~stdatomic.h~), mutexes, condition variables, etc.

*** Q106: What is const correctness?
Const correctness means using ~const~ to express read-only intent and enforce it via the type system.
It improves API clarity and catches accidental modification at compile time.

#+begin_src c
void print_arr(const int *a, size_t n);
#+end_src

*** Q107: Explain storage durations in C.
- *Automatic*: usually local variables in a block; lifetime ends when block exits.
- *Static*: globals and ~static~ locals; lifetime is entire program.
- *Thread storage* (C11): one instance per thread, lifetime of thread.
- *Allocated*: dynamic memory from ~malloc/calloc/realloc~ until ~free~.

*** Q108: What is the difference between stack and heap?
- *Stack* (common implementation): call-frame based, automatic storage, fast allocation/deallocation.
- *Heap*: dynamic allocation under programmer control (~malloc/free~), flexible lifetime.
These are implementation concepts, not strict C language terms.

*** Q109: What are function pointers used for?
They let you pass behavior as data.
Common use: callbacks, plugin-like dispatch, state-machine/action tables.

#+begin_src c
int add(int a, int b) { return a + b; }
int (*op)(int, int) = add;
int r = op(2, 3);
#+end_src

*** Q110: What are common secure coding pitfalls in C?
- Buffer overflow (unchecked copy/format operations)
- Format string bugs (~printf(user_input)~)
- Integer overflow/underflow in size math
- Use-after-free / double-free
- Missing validation and bounds checks
- Ignoring return values from critical APIs

*** Q111: What is one-definition expectation in C practice?
In normal C practice, each externally visible function/object should have one true definition, with matching declarations everywhere.
Inconsistency across translation units can cause link/runtime problems and UB.

*** Q112: What happens with conflicting declarations?
If declarations disagree (type, qualifiers, parameters, linkage), compiler may emit diagnostics.
If not caught, behavior can become undefined at runtime or link time.

*** Q113: What is tentative definition?
A file-scope declaration like ~int x;~ (without initializer) is tentative.
If no full definition appears in that translation unit, it acts as a definition with zero initialization.

*** Q114: What is internal vs external linkage?
- *Internal linkage*: symbol visible only inside one translation unit (usually ~static~ at file scope).
- *External linkage*: symbol can be referenced across translation units.

*** Q115: What is inline semantics nuance in C?
C inline rules differ from C++.
Whether a definition emits code depends on ~inline~, ~extern inline~, ~static inline~, and compiler mode.
Use one consistent project style to avoid linker surprises.

*** Q116: What is strict prototype?
A strict prototype fully specifies parameter list, e.g. ~int f(void);~.
This enables proper type checking at call sites.

*** Q117: Why avoid old-style function declarations?
Old K&R-style declarations weaken type checking and can hide mismatches.
Prefer modern prototypes in all headers and source files.

*** Q118: What is effective type?
Effective type governs which lvalue types may legally access stored object bytes.
It is central to aliasing rules and optimization assumptions.

*** Q119: Is type-punning through union always portable?
Not universally. Some forms are accepted by compilers/extensions, but portability is subtle.
For strict portability, prefer ~memcpy~ between object representations.

*** Q120: Why is reading uninitialized memory UB?
Uninitialized objects have indeterminate values (sometimes trap representations).
Using such values in most expressions is UB.

*** Q121: What is trap representation?
A bit pattern that does not represent a valid value for a type on some implementations.
Reading it through that type may trap or be UB.

*** Q122: Why can memcmp on structs be misleading?
Struct padding bytes may be uninitialized/indeterminate.
Two structs that are logically equal may differ in raw padding bytes, so ~memcmp~ can report inequality.

*** Q123: What is object lifetime?
The time interval where an object exists and may be accessed validly.
Before lifetime begins or after it ends, access is invalid (often UB).

*** Q124: Can pointer remain valid after realloc?
On success, ~realloc~ may move the allocation; only returned pointer is valid.
Old pointer becomes invalid.
On failure, old pointer remains valid and unchanged.

