public/posts/c-programming.html
<div id="outline-container-orgc0ebd7a" class="outline-4">
<h4 id="orgc0ebd7a">Q103: What is strict aliasing?</h4>
<div class="outline-text-4" id="text-orgc0ebd7a">
<p>
Strict aliasing is an optimization rule: an object should be accessed through a compatible type (with limited exceptions).
Violating this rule is UB and may break code under optimization.
Portable alternatives for type reinterpretation usually involve <code>memcpy</code>.
</p>
</div>
</div>
<div id="outline-container-org8c2660d" class="outline-4">
<h4 id="org8c2660d">Q104: What is the volatile qualifier?</h4>
<div class="outline-text-4" id="text-org8c2660d">
<p>
<code>volatile</code> tells the compiler that reads/writes to an object are observable side effects and must not be optimized away or merged too aggressively.
Typical use: memory-mapped I/O registers, signal-updated flags.
It does <b>not</b> make operations atomic or thread-safe.
</p>
</div>
</div>
<div id="outline-container-org0cfb408" class="outline-4">
<h4 id="org0cfb408">Q105: Is volatile enough for thread synchronization?</h4>
<div class="outline-text-4" id="text-org0cfb408">
<p>
No. <code>volatile</code> does not provide mutual exclusion, atomicity, or inter-thread ordering guarantees.
Use C11 atomics (<code>stdatomic.h</code>), mutexes, condition variables, etc.
</p>
</div>
</div>
<div id="outline-container-org75acf62" class="outline-4">
<h4 id="org75acf62">Q106: What is const correctness?</h4>
<div class="outline-text-4" id="text-org75acf62">
<p>
Const correctness means using <code>const</code> to express read-only intent and enforce it via the type system.
It improves API clarity and catches accidental modification at compile time.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">print_arr</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">n</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgff19b80" class="outline-4">
<h4 id="orgff19b80">Q107: Explain storage durations in C.</h4>
<div class="outline-text-4" id="text-orgff19b80">
<ul class="org-ul">
<li><b>Automatic</b>: usually local variables in a block; lifetime ends when block exits.</li>
<li><b>Static</b>: globals and <code>static</code> locals; lifetime is entire program.</li>
<li><b>Thread storage</b> (C11): one instance per thread, lifetime of thread.</li>
<li><b>Allocated</b>: dynamic memory from <code>malloc/calloc/realloc</code> until <code>free</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-org9ce0910" class="outline-4">
<h4 id="org9ce0910">Q108: What is the difference between stack and heap?</h4>
<div class="outline-text-4" id="text-org9ce0910">
<ul class="org-ul">
<li><b>Stack</b> (common implementation): call-frame based, automatic storage, fast allocation/deallocation.</li>
<li><b>Heap</b>: dynamic allocation under programmer control (<code>malloc/free</code>), flexible lifetime.</li>
</ul>
<p>
These are implementation concepts, not strict C language terms.
</p>
</div>
</div>
<div id="outline-container-org7046688" class="outline-4">
<h4 id="org7046688">Q109: What are function pointers used for?</h4>
<div class="outline-text-4" id="text-org7046688">
<p>
They let you pass behavior as data.
Common use: callbacks, plugin-like dispatch, state-machine/action tables.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">add</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">b</span>) { <span style="font-weight: bold;">return</span> a + b; }
<span style="font-weight: bold; text-decoration: underline;">int</span> (*<span style="font-weight: bold;">op</span>)(<span style="font-weight: bold; text-decoration: underline;">int</span>, <span style="font-weight: bold; text-decoration: underline;">int</span>) = add;
<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">r</span> = op(2, 3);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd7fbd76" class="outline-4">
<h4 id="orgd7fbd76">Q110: What are common secure coding pitfalls in C?</h4>
<div class="outline-text-4" id="text-orgd7fbd76">
<ul class="org-ul">
<li>Buffer overflow (unchecked copy/format operations)</li>
<li>Format string bugs (<code>printf(user_input)</code>)</li>
<li>Integer overflow/underflow in size math</li>
<li>Use-after-free / double-free</li>
<li>Missing validation and bounds checks</li>
<li>Ignoring return values from critical APIs</li>
</ul>
</div>
</div>
<div id="outline-container-orgd1b1a59" class="outline-4">
<h4 id="orgd1b1a59">Q111: What is one-definition expectation in C practice?</h4>
<div class="outline-text-4" id="text-orgd1b1a59">
<p>
In normal C practice, each externally visible function/object should have one true definition, with matching declarations everywhere.
Inconsistency across translation units can cause link/runtime problems and UB.
</p>
</div>
</div>
<div id="outline-container-org9886574" class="outline-4">
<h4 id="org9886574">Q112: What happens with conflicting declarations?</h4>
<div class="outline-text-4" id="text-org9886574">
<p>
If declarations disagree (type, qualifiers, parameters, linkage), compiler may emit diagnostics.
If not caught, behavior can become undefined at runtime or link time.
</p>
</div>
</div>
<div id="outline-container-org1502c60" class="outline-4">
<h4 id="org1502c60">Q113: What is tentative definition?</h4>
<div class="outline-text-4" id="text-org1502c60">
<p>
A file-scope declaration like <code>int x;</code> (without initializer) is tentative.
If no full definition appears in that translation unit, it acts as a definition with zero initialization.
</p>
</div>
</div>
<div id="outline-container-org2d2fc33" class="outline-4">
<h4 id="org2d2fc33">Q114: What is internal vs external linkage?</h4>
<div class="outline-text-4" id="text-org2d2fc33">
<ul class="org-ul">
<li><b>Internal linkage</b>: symbol visible only inside one translation unit (usually <code>static</code> at file scope).</li>
<li><b>External linkage</b>: symbol can be referenced across translation units.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb8fab08" class="outline-4">
<h4 id="orgb8fab08">Q115: What is inline semantics nuance in C?</h4>
<div class="outline-text-4" id="text-orgb8fab08">
<p>
C inline rules differ from C++.
Whether a definition emits code depends on <code>inline</code>, <code>extern inline</code>, <code>static inline</code>, and compiler mode.
Use one consistent project style to avoid linker surprises.
</p>
</div>
</div>
<div id="outline-container-org1d3c271" class="outline-4">
<h4 id="org1d3c271">Q116: What is strict prototype?</h4>
<div class="outline-text-4" id="text-org1d3c271">
<p>
A strict prototype fully specifies parameter list, e.g. <code>int f(void);</code>.
This enables proper type checking at call sites.
</p>
</div>
</div>
<div id="outline-container-org28178e7" class="outline-4">
<h4 id="org28178e7">Q117: Why avoid old-style function declarations?</h4>
<div class="outline-text-4" id="text-org28178e7">
<p>
Old K&amp;R-style declarations weaken type checking and can hide mismatches.
Prefer modern prototypes in all headers and source files.
</p>
</div>
</div>
<div id="outline-container-org8b6c745" class="outline-4">
<h4 id="org8b6c745">Q118: What is effective type?</h4>
<div class="outline-text-4" id="text-org8b6c745">
<p>
Effective type governs which lvalue types may legally access stored object bytes.
It is central to aliasing rules and optimization assumptions.
</p>
</div>
</div>
<div id="outline-container-org04fabfe" class="outline-4">
<h4 id="org04fabfe">Q119: Is type-punning through union always portable?</h4>
<div class="outline-text-4" id="text-org04fabfe">
<p>
Not universally. Some forms are accepted by compilers/extensions, but portability is subtle.
For strict portability, prefer <code>memcpy</code> between object representations.
</p>
</div>
</div>
<div id="outline-container-orgc7ee73c" class="outline-4">
<h4 id="orgc7ee73c">Q120: Why is reading uninitialized memory UB?</h4>
<div class="outline-text-4" id="text-orgc7ee73c">
<p>
Uninitialized objects have indeterminate values (sometimes trap representations).
Using such values in most expressions is UB.
</p>
</div>
</div>
<div id="outline-container-org885c5ad" class="outline-4">
<h4 id="org885c5ad">Q121: What is trap representation?</h4>
<div class="outline-text-4" id="text-org885c5ad">
<p>
A bit pattern that does not represent a valid value for a type on some implementations.
Reading it through that type may trap or be UB.
</p>
</div>
</div>
<div id="outline-container-org9aa0691" class="outline-4">
<h4 id="org9aa0691">Q122: Why can memcmp on structs be misleading?</h4>
<div class="outline-text-4" id="text-org9aa0691">
<p>
Struct padding bytes may be uninitialized/indeterminate.
Two structs that are logically equal may differ in raw padding bytes, so <code>memcmp</code> can report inequality.
</p>
</div>
</div>
<div id="outline-container-orgc46762c" class="outline-4">
<h4 id="orgc46762c">Q123: What is object lifetime?</h4>
<div class="outline-text-4" id="text-orgc46762c">
<p>
The time interval where an object exists and may be accessed validly.
Before lifetime begins or after it ends, access is invalid (often UB).
</p>
</div>
</div>
<div id="outline-container-orgaf3b351" class="outline-4">
<h4 id="orgaf3b351">Q124: Can pointer remain valid after realloc?</h4>
<div class="outline-text-4" id="text-orgaf3b351">
<p>
On success, <code>realloc</code> may move the allocation; only returned pointer is valid.
Old pointer becomes invalid.
On failure, old pointer remains valid and unchanged.
</p>
</div>
</div>
