org/posts/c-programming.org
*** Q125: What is provenance concept (informal)?
Pointer provenance is the idea that compilers track which allocation/object a pointer comes from.
Invalid casts/arithmetic can lose valid provenance assumptions.

*** Q126: Why is out-of-bounds pointer arithmetic dangerous?
You may form at most one-past-end pointer (not dereferenceable).
Going further is UB, even if you do not dereference immediately.

*** Q127: Is signed right shift portable?
For negative signed values, result is implementation-defined.
Do not assume arithmetic shift unless documented for your targets.

*** Q128: Is left-shifting into sign bit safe?
For signed integers, shifting into/sign-changing overflow is often UB.
Prefer unsigned integers for bit manipulation.

*** Q129: What is sequence before/after terminology (modern)?
Modern C describes ordering using “sequenced before/after” relations.
If side effects are unsequenced relative to each other on same scalar object, UB can occur.

*** Q130: Example of unsequenced modification UB
#+begin_src c
i = i++ + f(i);   // UB
#+end_src

*** Q131: What is atomic type in C11?
Atomic types from ~stdatomic.h~ support atomic reads/writes/RMW operations with selectable memory ordering.

*** Q132: What is atomic_init used for?
It initializes atomic objects (especially automatic/dynamic storage) in a defined way.

*** Q133: When use memory_order_relaxed?
Use when you only need atomicity (no synchronization ordering), e.g., independent counters/statistics.

*** Q134: What do acquire/release guarantee?
A release store followed by acquire load of same synchronization variable establishes happens-before.
Writes before release become visible after acquire.

*** Q135: Why default to memory_order_seq_cst initially?
It is easiest to reason about and safest for correctness during initial implementation.
Relax ordering only when profiling/analysis justifies it.

*** Q136: What is data race in C11?
Concurrent conflicting accesses (at least one write) to same location without synchronization and not all atomic.
Data races are UB in C11.

*** Q137: Is volatile sig_atomic_t for signal handlers?
Yes, for simple flag communication with handlers it is the traditional minimal safe type.
Keep handler logic minimal.

*** Q138: Can printf be called from signal handler?
Generally no. ~printf~ is not async-signal-safe.

*** Q139: What is reentrancy?
A reentrant function can be safely interrupted and called again before previous invocation finishes.

*** Q140: What is thread safety?
A thread-safe component behaves correctly when used concurrently from multiple threads.

*** Q141: Difference between static and dynamic linking?
- *Static linking*: library code copied into final executable.
- *Dynamic linking*: executable references shared libraries loaded at runtime.

*** Q142: What is ABI?
ABI (Application Binary Interface) is the low-level binary contract:
calling conventions, data layout, symbol naming, alignment, exception/return conventions.

*** Q143: Why care about struct layout for ABI?
Changing member order/type/padding changes binary layout and may break compatibility with existing binaries.

*** Q144: What is symbol visibility?
Visibility controls what symbols a shared library exports.
Limiting exports can reduce symbol collisions and sometimes improve load/startup behavior.

*** Q145: What compiler warnings are most useful early?
A common baseline: ~-Wall -Wextra -Wpedantic -Wconversion -Wshadow~.
Tune per codebase; avoid warning fatigue.

*** Q146: Why use multiple compilers in CI?
Different compilers catch different bugs/warnings and optimize differently.
This improves portability and bug detection.

*** Q147: What are optimization levels (-O0/-O2/-O3/-Os)?
- ~-O0~: easiest debugging, minimal optimization
- ~-O2~: balanced and common production default
- ~-O3~: more aggressive, may increase code size
- ~-Os~: optimize for size

*** Q148: Why test with and without optimization?
Some UB and timing-sensitive issues appear only under optimization.
Both modes give better confidence.

*** Q149: What is LTO (Link Time Optimization)?
Optimization performed at link stage across translation units for whole-program opportunities.

*** Q150: What is PGO (Profile-Guided Optimization)?
Compiler uses collected runtime profiles to optimize hot paths, branch layout, and inlining decisions.

** Expert Level

*** Q151: What are sequence points / evaluation order concerns?
Evaluation order is often unspecified in C.
Expressions with multiple side effects on same object without sequencing can be UB.
Write simpler statements to make ordering explicit.

*** Q152: What is the memory model in C11?
C11 defines atomics and memory orders to reason about visibility and ordering among threads.
Key orders: relaxed, acquire, release, acq_rel, seq_cst.

*** Q153: Why can signed integer overflow be dangerous?
Signed overflow is UB; compiler assumes it never happens and may remove/transform checks.
Use unsigned/wider types or explicit checked arithmetic.

*** Q154: What is alignment and why does it matter?
Types may require addresses with specific alignment.
Misalignment can hurt performance or fault on some hardware.
Use ~_Alignof~, aligned allocation, and alignment-aware layouts.

