public/posts/c-programming.html
<div id="outline-container-org03e4826" class="outline-4">
<h4 id="org03e4826">Q125: What is provenance concept (informal)?</h4>
<div class="outline-text-4" id="text-org03e4826">
<p>
Pointer provenance is the idea that compilers track which allocation/object a pointer comes from.
Invalid casts/arithmetic can lose valid provenance assumptions.
</p>
</div>
</div>
<div id="outline-container-org3c30740" class="outline-4">
<h4 id="org3c30740">Q126: Why is out-of-bounds pointer arithmetic dangerous?</h4>
<div class="outline-text-4" id="text-org3c30740">
<p>
You may form at most one-past-end pointer (not dereferenceable).
Going further is UB, even if you do not dereference immediately.
</p>
</div>
</div>
<div id="outline-container-org3462d1d" class="outline-4">
<h4 id="org3462d1d">Q127: Is signed right shift portable?</h4>
<div class="outline-text-4" id="text-org3462d1d">
<p>
For negative signed values, result is implementation-defined.
Do not assume arithmetic shift unless documented for your targets.
</p>
</div>
</div>
<div id="outline-container-org93327db" class="outline-4">
<h4 id="org93327db">Q128: Is left-shifting into sign bit safe?</h4>
<div class="outline-text-4" id="text-org93327db">
<p>
For signed integers, shifting into/sign-changing overflow is often UB.
Prefer unsigned integers for bit manipulation.
</p>
</div>
</div>
<div id="outline-container-orgf4a13ce" class="outline-4">
<h4 id="orgf4a13ce">Q129: What is sequence before/after terminology (modern)?</h4>
<div class="outline-text-4" id="text-orgf4a13ce">
<p>
Modern C describes ordering using “sequenced before/after” relations.
If side effects are unsequenced relative to each other on same scalar object, UB can occur.
</p>
</div>
</div>
<div id="outline-container-orge043edc" class="outline-4">
<h4 id="orge043edc">Q130: Example of unsequenced modification UB</h4>
<div class="outline-text-4" id="text-orge043edc">
<div class="org-src-container">
<pre class="src src-c">i = i++ + f(i);   <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">UB</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org21b0fdc" class="outline-4">
<h4 id="org21b0fdc">Q131: What is atomic type in C11?</h4>
<div class="outline-text-4" id="text-org21b0fdc">
<p>
Atomic types from <code>stdatomic.h</code> support atomic reads/writes/RMW operations with selectable memory ordering.
</p>
</div>
</div>
<div id="outline-container-org3928655" class="outline-4">
<h4 id="org3928655">Q132: What is atomic<sub>init</sub> used for?</h4>
<div class="outline-text-4" id="text-org3928655">
<p>
It initializes atomic objects (especially automatic/dynamic storage) in a defined way.
</p>
</div>
</div>
<div id="outline-container-org6d6581d" class="outline-4">
<h4 id="org6d6581d">Q133: When use memory<sub>order</sub><sub>relaxed</sub>?</h4>
<div class="outline-text-4" id="text-org6d6581d">
<p>
Use when you only need atomicity (no synchronization ordering), e.g., independent counters/statistics.
</p>
</div>
</div>
<div id="outline-container-org92d4436" class="outline-4">
<h4 id="org92d4436">Q134: What do acquire/release guarantee?</h4>
<div class="outline-text-4" id="text-org92d4436">
<p>
A release store followed by acquire load of same synchronization variable establishes happens-before.
Writes before release become visible after acquire.
</p>
</div>
</div>
<div id="outline-container-org2f27707" class="outline-4">
<h4 id="org2f27707">Q135: Why default to memory<sub>order</sub><sub>seq</sub><sub>cst</sub> initially?</h4>
<div class="outline-text-4" id="text-org2f27707">
<p>
It is easiest to reason about and safest for correctness during initial implementation.
Relax ordering only when profiling/analysis justifies it.
</p>
</div>
</div>
<div id="outline-container-orgac140d3" class="outline-4">
<h4 id="orgac140d3">Q136: What is data race in C11?</h4>
<div class="outline-text-4" id="text-orgac140d3">
<p>
Concurrent conflicting accesses (at least one write) to same location without synchronization and not all atomic.
Data races are UB in C11.
</p>
</div>
</div>
<div id="outline-container-org70b164f" class="outline-4">
<h4 id="org70b164f">Q137: Is volatile sig<sub>atomic</sub><sub>t</sub> for signal handlers?</h4>
<div class="outline-text-4" id="text-org70b164f">
<p>
Yes, for simple flag communication with handlers it is the traditional minimal safe type.
Keep handler logic minimal.
</p>
</div>
</div>
<div id="outline-container-org26efb5d" class="outline-4">
<h4 id="org26efb5d">Q138: Can printf be called from signal handler?</h4>
<div class="outline-text-4" id="text-org26efb5d">
<p>
Generally no. <code>printf</code> is not async-signal-safe.
</p>
</div>
</div>
<div id="outline-container-org96d8def" class="outline-4">
<h4 id="org96d8def">Q139: What is reentrancy?</h4>
<div class="outline-text-4" id="text-org96d8def">
<p>
A reentrant function can be safely interrupted and called again before previous invocation finishes.
</p>
</div>
</div>
<div id="outline-container-org666f07e" class="outline-4">
<h4 id="org666f07e">Q140: What is thread safety?</h4>
<div class="outline-text-4" id="text-org666f07e">
<p>
A thread-safe component behaves correctly when used concurrently from multiple threads.
</p>
</div>
</div>
<div id="outline-container-org2c85610" class="outline-4">
<h4 id="org2c85610">Q141: Difference between static and dynamic linking?</h4>
<div class="outline-text-4" id="text-org2c85610">
<ul class="org-ul">
<li><b>Static linking</b>: library code copied into final executable.</li>
<li><b>Dynamic linking</b>: executable references shared libraries loaded at runtime.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc71bde1" class="outline-4">
<h4 id="orgc71bde1">Q142: What is ABI?</h4>
<div class="outline-text-4" id="text-orgc71bde1">
<p>
ABI (Application Binary Interface) is the low-level binary contract:
calling conventions, data layout, symbol naming, alignment, exception/return conventions.
</p>
</div>
</div>
<div id="outline-container-orged2736b" class="outline-4">
<h4 id="orged2736b">Q143: Why care about struct layout for ABI?</h4>
<div class="outline-text-4" id="text-orged2736b">
<p>
Changing member order/type/padding changes binary layout and may break compatibility with existing binaries.
</p>
</div>
</div>
<div id="outline-container-orga41bbbf" class="outline-4">
<h4 id="orga41bbbf">Q144: What is symbol visibility?</h4>
<div class="outline-text-4" id="text-orga41bbbf">
<p>
Visibility controls what symbols a shared library exports.
Limiting exports can reduce symbol collisions and sometimes improve load/startup behavior.
</p>
</div>
</div>
<div id="outline-container-org84018d2" class="outline-4">
<h4 id="org84018d2">Q145: What compiler warnings are most useful early?</h4>
<div class="outline-text-4" id="text-org84018d2">
<p>
A common baseline: <code>-Wall -Wextra -Wpedantic -Wconversion -Wshadow</code>.
Tune per codebase; avoid warning fatigue.
</p>
</div>
</div>
<div id="outline-container-orgc43852b" class="outline-4">
<h4 id="orgc43852b">Q146: Why use multiple compilers in CI?</h4>
<div class="outline-text-4" id="text-orgc43852b">
<p>
Different compilers catch different bugs/warnings and optimize differently.
This improves portability and bug detection.
</p>
</div>
</div>
<div id="outline-container-orgecdd1e3" class="outline-4">
<h4 id="orgecdd1e3">Q147: What are optimization levels (-O0/-O2/-O3/-Os)?</h4>
<div class="outline-text-4" id="text-orgecdd1e3">
<ul class="org-ul">
<li><code>-O0</code>: easiest debugging, minimal optimization</li>
<li><code>-O2</code>: balanced and common production default</li>
<li><code>-O3</code>: more aggressive, may increase code size</li>
<li><code>-Os</code>: optimize for size</li>
</ul>
</div>
</div>
<div id="outline-container-org409a6f2" class="outline-4">
<h4 id="org409a6f2">Q148: Why test with and without optimization?</h4>
<div class="outline-text-4" id="text-org409a6f2">
<p>
Some UB and timing-sensitive issues appear only under optimization.
Both modes give better confidence.
</p>
</div>
</div>
<div id="outline-container-orge917039" class="outline-4">
<h4 id="orge917039">Q149: What is LTO (Link Time Optimization)?</h4>
<div class="outline-text-4" id="text-orge917039">
<p>
Optimization performed at link stage across translation units for whole-program opportunities.
</p>
</div>
</div>
<div id="outline-container-org9a4a44f" class="outline-4">
<h4 id="org9a4a44f">Q150: What is PGO (Profile-Guided Optimization)?</h4>
<div class="outline-text-4" id="text-org9a4a44f">
<p>
Compiler uses collected runtime profiles to optimize hot paths, branch layout, and inlining decisions.
</p>
</div>
</div>
</div>
<div id="outline-container-org99297f1" class="outline-3">
<h3 id="org99297f1">Expert Level</h3>
<div class="outline-text-3" id="text-org99297f1">
</div>
<div id="outline-container-org5509c02" class="outline-4">
<h4 id="org5509c02">Q151: What are sequence points / evaluation order concerns?</h4>
<div class="outline-text-4" id="text-org5509c02">
<p>
Evaluation order is often unspecified in C.
Expressions with multiple side effects on same object without sequencing can be UB.
Write simpler statements to make ordering explicit.
</p>
</div>
</div>
<div id="outline-container-orgada4954" class="outline-4">
<h4 id="orgada4954">Q152: What is the memory model in C11?</h4>
<div class="outline-text-4" id="text-orgada4954">
<p>
C11 defines atomics and memory orders to reason about visibility and ordering among threads.
Key orders: relaxed, acquire, release, acq<sub>rel</sub>, seq<sub>cst</sub>.
</p>
</div>
</div>
<div id="outline-container-org584977e" class="outline-4">
<h4 id="org584977e">Q153: Why can signed integer overflow be dangerous?</h4>
<div class="outline-text-4" id="text-org584977e">
<p>
Signed overflow is UB; compiler assumes it never happens and may remove/transform checks.
Use unsigned/wider types or explicit checked arithmetic.
</p>
</div>
</div>
<div id="outline-container-orgbc819c8" class="outline-4">
<h4 id="orgbc819c8">Q154: What is alignment and why does it matter?</h4>
<div class="outline-text-4" id="text-orgbc819c8">
<p>
Types may require addresses with specific alignment.
Misalignment can hurt performance or fault on some hardware.
Use <code>_Alignof</code>, aligned allocation, and alignment-aware layouts.
</p>
</div>
</div>
