org/posts/c-programming.org
*** Q155: What is padding in structs?
Compiler inserts padding for alignment between fields and/or at end.
This affects binary layout, size, serialization, and memcmp behavior.

*** Q156: How do you write portable C across compilers/platforms?
- Stick to standard C
- Use ~stdint.h~ fixed-width types where appropriate
- Avoid UB/non-portable assumptions
- Isolate platform code behind clear interfaces
- Build/test on multiple targets and compilers

*** Q157: What are sanitizers and why use them?
- ASan: invalid memory access, UAF, overflow
- UBSan: undefined behavior checks
- TSan: data-race detection
They turn subtle bugs into actionable failures during tests.

*** Q158: What is the purpose of the preprocessor beyond includes?
- Macros (~#define~)
- Conditional compilation (~#if/#ifdef~)
- Token/string tricks (~##~, ~#~)
Prefer typed alternatives (enum, ~static inline~) when possible.

*** Q159: What is link-time behavior every expert should know?
Understand linkage, symbol resolution order, ~static~ vs ~extern~, archive/shared library resolution, and ODR-like consistency expectations in C projects.

*** Q160: What is a robust expert workflow for C development?
1. Strict warnings
2. Static analysis
3. Unit/integration tests
4. Sanitizers + fuzzing
5. Review for UB/lifetime/concurrency
6. Document contracts/invariants

*** Q161: What is branch prediction and why it matters?
CPUs predict branch direction to keep pipelines full.
Frequent mispredictions cause stalls and reduce performance.

*** Q162: Should you micro-optimize prematurely in C?
No. Profile first; optimize measured hotspots.

*** Q163: What is cache locality?
Access patterns with nearby/reused data improve cache hit rates and speed.

*** Q164: Array of structs vs struct of arrays?
- AoS: good for per-object operations
- SoA: often better for SIMD/vectorized or column-style processing

*** Q165: What is false sharing?
Different threads updating different variables on same cache line trigger heavy coherence traffic.

*** Q166: How reduce false sharing?
Separate hot per-thread data onto different cache lines (padding/alignment/layout redesign).

*** Q167: What is memory pool allocator?
Custom allocator tuned for repeated allocation patterns/sizes, reducing overhead and fragmentation.

*** Q168: Trade-off of custom allocators?
Potential speed/control gains vs complexity, maintenance cost, and debugging burden.

*** Q169: What is zero-copy I/O concept?
Avoid unnecessary data copies between kernel/user/buffers to improve throughput and latency.

*** Q170: Why beware of undefined signed overflow in checksum math?
Overflow assumptions may let optimizer alter logic incorrectly.
Use unsigned or wider arithmetic for defined wrap behavior.

*** Q171: What is saturating arithmetic and when useful?
Arithmetic that clamps to min/max on overflow.
Useful in DSP/image/signal domains where wraparound is undesirable.

*** Q172: How to check multiplication overflow safely?
#+begin_src c
if (a != 0 && b > SIZE_MAX / a) { /* overflow */ }
#+end_src

*** Q173: Why validate size computations before allocation?
Overflow in ~count * elem_size~ can allocate too little memory, causing later buffer overflow.

*** Q174: What is hardened build baseline for C?
Typical baseline: strict warnings, stack protector, fortify, PIE, RELRO, NX (toolchain/platform dependent).

*** Q175: What is fuzz testing?
Automated randomized/mutated input generation to discover crashes, hangs, and logic flaws.

*** Q176: Why combine fuzzing with sanitizers?
Fuzzer finds odd inputs; sanitizers make hidden memory/UB issues crash with diagnostics.

*** Q177: What is minimization in fuzzing?
Reducing a failing input to the smallest reproducer for faster root-cause debugging.

*** Q178: What is regression test?
A test added after fixing a bug to ensure it never returns.

*** Q179: What is golden-file testing?
Compare output to approved reference files; useful when output format is stable and intentional.

*** Q180: What is deterministic build?
Given same source, inputs, and toolchain, output binary is identical.

*** Q181: Why pin toolchain versions in CI?
Ensures reproducibility and consistent warnings/performance characteristics over time.

*** Q182: What is cross-compilation?
Building on one architecture/OS for another target architecture/OS.

*** Q183: Portable endianness handling best practice?
Use explicit encode/decode helpers and byte-order conversion functions; never rely on host layout.

*** Q184: Why avoid writing raw structs directly to disk/network?
Padding, alignment, ABI, and endianness differences break portability and compatibility.

*** Q185: What is stable wire format?
A defined serialized representation independent of in-memory C layout.

*** Q186: How design forward-compatible binary format?
Include version fields, lengths, optional/reserved sections, and clear parsing rules.

*** Q187: What is feature-test macro usage?
Feature-test macros explicitly select API/standard visibility (e.g., POSIX levels), improving portability control.

