public/posts/c-programming.html
<div id="outline-container-orgb4af81b" class="outline-4">
<h4 id="orgb4af81b">Q155: What is padding in structs?</h4>
<div class="outline-text-4" id="text-orgb4af81b">
<p>
Compiler inserts padding for alignment between fields and/or at end.
This affects binary layout, size, serialization, and memcmp behavior.
</p>
</div>
</div>
<div id="outline-container-org0159045" class="outline-4">
<h4 id="org0159045">Q156: How do you write portable C across compilers/platforms?</h4>
<div class="outline-text-4" id="text-org0159045">
<ul class="org-ul">
<li>Stick to standard C</li>
<li>Use <code>stdint.h</code> fixed-width types where appropriate</li>
<li>Avoid UB/non-portable assumptions</li>
<li>Isolate platform code behind clear interfaces</li>
<li>Build/test on multiple targets and compilers</li>
</ul>
</div>
</div>
<div id="outline-container-org9069a26" class="outline-4">
<h4 id="org9069a26">Q157: What are sanitizers and why use them?</h4>
<div class="outline-text-4" id="text-org9069a26">
<ul class="org-ul">
<li>ASan: invalid memory access, UAF, overflow</li>
<li>UBSan: undefined behavior checks</li>
<li>TSan: data-race detection</li>
</ul>
<p>
They turn subtle bugs into actionable failures during tests.
</p>
</div>
</div>
<div id="outline-container-org02acb9f" class="outline-4">
<h4 id="org02acb9f">Q158: What is the purpose of the preprocessor beyond includes?</h4>
<div class="outline-text-4" id="text-org02acb9f">
<ul class="org-ul">
<li>Macros (<code>#define</code>)</li>
<li>Conditional compilation (<code>#if/#ifdef</code>)</li>
<li>Token/string tricks (<code>##</code>, <code>#</code>)</li>
</ul>
<p>
Prefer typed alternatives (enum, <code>static inline</code>) when possible.
</p>
</div>
</div>
<div id="outline-container-org5a8a955" class="outline-4">
<h4 id="org5a8a955">Q159: What is link-time behavior every expert should know?</h4>
<div class="outline-text-4" id="text-org5a8a955">
<p>
Understand linkage, symbol resolution order, <code>static</code> vs <code>extern</code>, archive/shared library resolution, and ODR-like consistency expectations in C projects.
</p>
</div>
</div>
<div id="outline-container-org68ba260" class="outline-4">
<h4 id="org68ba260">Q160: What is a robust expert workflow for C development?</h4>
<div class="outline-text-4" id="text-org68ba260">
<ol class="org-ol">
<li>Strict warnings</li>
<li>Static analysis</li>
<li>Unit/integration tests</li>
<li>Sanitizers + fuzzing</li>
<li>Review for UB/lifetime/concurrency</li>
<li>Document contracts/invariants</li>
</ol>
</div>
</div>
<div id="outline-container-org2a5f5e2" class="outline-4">
<h4 id="org2a5f5e2">Q161: What is branch prediction and why it matters?</h4>
<div class="outline-text-4" id="text-org2a5f5e2">
<p>
CPUs predict branch direction to keep pipelines full.
Frequent mispredictions cause stalls and reduce performance.
</p>
</div>
</div>
<div id="outline-container-org8bee556" class="outline-4">
<h4 id="org8bee556">Q162: Should you micro-optimize prematurely in C?</h4>
<div class="outline-text-4" id="text-org8bee556">
<p>
No. Profile first; optimize measured hotspots.
</p>
</div>
</div>
<div id="outline-container-org966585b" class="outline-4">
<h4 id="org966585b">Q163: What is cache locality?</h4>
<div class="outline-text-4" id="text-org966585b">
<p>
Access patterns with nearby/reused data improve cache hit rates and speed.
</p>
</div>
</div>
<div id="outline-container-org5a94c3b" class="outline-4">
<h4 id="org5a94c3b">Q164: Array of structs vs struct of arrays?</h4>
<div class="outline-text-4" id="text-org5a94c3b">
<ul class="org-ul">
<li>AoS: good for per-object operations</li>
<li>SoA: often better for SIMD/vectorized or column-style processing</li>
</ul>
</div>
</div>
<div id="outline-container-org716741b" class="outline-4">
<h4 id="org716741b">Q165: What is false sharing?</h4>
<div class="outline-text-4" id="text-org716741b">
<p>
Different threads updating different variables on same cache line trigger heavy coherence traffic.
</p>
</div>
</div>
<div id="outline-container-orgcf6c017" class="outline-4">
<h4 id="orgcf6c017">Q166: How reduce false sharing?</h4>
<div class="outline-text-4" id="text-orgcf6c017">
<p>
Separate hot per-thread data onto different cache lines (padding/alignment/layout redesign).
</p>
</div>
</div>
<div id="outline-container-orge9a61bb" class="outline-4">
<h4 id="orge9a61bb">Q167: What is memory pool allocator?</h4>
<div class="outline-text-4" id="text-orge9a61bb">
<p>
Custom allocator tuned for repeated allocation patterns/sizes, reducing overhead and fragmentation.
</p>
</div>
</div>
<div id="outline-container-orgf032f6c" class="outline-4">
<h4 id="orgf032f6c">Q168: Trade-off of custom allocators?</h4>
<div class="outline-text-4" id="text-orgf032f6c">
<p>
Potential speed/control gains vs complexity, maintenance cost, and debugging burden.
</p>
</div>
</div>
<div id="outline-container-orga31c9d6" class="outline-4">
<h4 id="orga31c9d6">Q169: What is zero-copy I/O concept?</h4>
<div class="outline-text-4" id="text-orga31c9d6">
<p>
Avoid unnecessary data copies between kernel/user/buffers to improve throughput and latency.
</p>
</div>
</div>
<div id="outline-container-orgafeb6a5" class="outline-4">
<h4 id="orgafeb6a5">Q170: Why beware of undefined signed overflow in checksum math?</h4>
<div class="outline-text-4" id="text-orgafeb6a5">
<p>
Overflow assumptions may let optimizer alter logic incorrectly.
Use unsigned or wider arithmetic for defined wrap behavior.
</p>
</div>
</div>
<div id="outline-container-org4c9baed" class="outline-4">
<h4 id="org4c9baed">Q171: What is saturating arithmetic and when useful?</h4>
<div class="outline-text-4" id="text-org4c9baed">
<p>
Arithmetic that clamps to min/max on overflow.
Useful in DSP/image/signal domains where wraparound is undesirable.
</p>
</div>
</div>
<div id="outline-container-org30dc0fb" class="outline-4">
<h4 id="org30dc0fb">Q172: How to check multiplication overflow safely?</h4>
<div class="outline-text-4" id="text-org30dc0fb">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">if</span> (a != 0 &amp;&amp; b &gt; SIZE_MAX / a) { <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">overflow</span><span style="font-weight: bold; font-style: italic;"> */</span> }
</pre>
</div>
</div>
</div>
<div id="outline-container-org0417d00" class="outline-4">
<h4 id="org0417d00">Q173: Why validate size computations before allocation?</h4>
<div class="outline-text-4" id="text-org0417d00">
<p>
Overflow in <code>count * elem_size</code> can allocate too little memory, causing later buffer overflow.
</p>
</div>
</div>
<div id="outline-container-orgfc8ed82" class="outline-4">
<h4 id="orgfc8ed82">Q174: What is hardened build baseline for C?</h4>
<div class="outline-text-4" id="text-orgfc8ed82">
<p>
Typical baseline: strict warnings, stack protector, fortify, PIE, RELRO, NX (toolchain/platform dependent).
</p>
</div>
</div>
<div id="outline-container-org1dc338a" class="outline-4">
<h4 id="org1dc338a">Q175: What is fuzz testing?</h4>
<div class="outline-text-4" id="text-org1dc338a">
<p>
Automated randomized/mutated input generation to discover crashes, hangs, and logic flaws.
</p>
</div>
</div>
<div id="outline-container-org333e6d6" class="outline-4">
<h4 id="org333e6d6">Q176: Why combine fuzzing with sanitizers?</h4>
<div class="outline-text-4" id="text-org333e6d6">
<p>
Fuzzer finds odd inputs; sanitizers make hidden memory/UB issues crash with diagnostics.
</p>
</div>
</div>
<div id="outline-container-org49f14c3" class="outline-4">
<h4 id="org49f14c3">Q177: What is minimization in fuzzing?</h4>
<div class="outline-text-4" id="text-org49f14c3">
<p>
Reducing a failing input to the smallest reproducer for faster root-cause debugging.
</p>
</div>
</div>
<div id="outline-container-orgf6d02aa" class="outline-4">
<h4 id="orgf6d02aa">Q178: What is regression test?</h4>
<div class="outline-text-4" id="text-orgf6d02aa">
<p>
A test added after fixing a bug to ensure it never returns.
</p>
</div>
</div>
<div id="outline-container-org97567da" class="outline-4">
<h4 id="org97567da">Q179: What is golden-file testing?</h4>
<div class="outline-text-4" id="text-org97567da">
<p>
Compare output to approved reference files; useful when output format is stable and intentional.
</p>
</div>
</div>
<div id="outline-container-orgcd3509d" class="outline-4">
<h4 id="orgcd3509d">Q180: What is deterministic build?</h4>
<div class="outline-text-4" id="text-orgcd3509d">
<p>
Given same source, inputs, and toolchain, output binary is identical.
</p>
</div>
</div>
<div id="outline-container-org8a4497c" class="outline-4">
<h4 id="org8a4497c">Q181: Why pin toolchain versions in CI?</h4>
<div class="outline-text-4" id="text-org8a4497c">
<p>
Ensures reproducibility and consistent warnings/performance characteristics over time.
</p>
</div>
</div>
<div id="outline-container-org00bf222" class="outline-4">
<h4 id="org00bf222">Q182: What is cross-compilation?</h4>
<div class="outline-text-4" id="text-org00bf222">
<p>
Building on one architecture/OS for another target architecture/OS.
</p>
</div>
</div>
<div id="outline-container-orgf8b947f" class="outline-4">
<h4 id="orgf8b947f">Q183: Portable endianness handling best practice?</h4>
<div class="outline-text-4" id="text-orgf8b947f">
<p>
Use explicit encode/decode helpers and byte-order conversion functions; never rely on host layout.
</p>
</div>
</div>
<div id="outline-container-orgc809f97" class="outline-4">
<h4 id="orgc809f97">Q184: Why avoid writing raw structs directly to disk/network?</h4>
<div class="outline-text-4" id="text-orgc809f97">
<p>
Padding, alignment, ABI, and endianness differences break portability and compatibility.
</p>
</div>
</div>
<div id="outline-container-org5df69eb" class="outline-4">
<h4 id="org5df69eb">Q185: What is stable wire format?</h4>
<div class="outline-text-4" id="text-org5df69eb">
<p>
A defined serialized representation independent of in-memory C layout.
</p>
</div>
</div>
<div id="outline-container-orgf094e73" class="outline-4">
<h4 id="orgf094e73">Q186: How design forward-compatible binary format?</h4>
<div class="outline-text-4" id="text-orgf094e73">
<p>
Include version fields, lengths, optional/reserved sections, and clear parsing rules.
</p>
</div>
</div>
<div id="outline-container-org7fd36e0" class="outline-4">
<h4 id="org7fd36e0">Q187: What is feature-test macro usage?</h4>
<div class="outline-text-4" id="text-org7fd36e0">
<p>
Feature-test macros explicitly select API/standard visibility (e.g., POSIX levels), improving portability control.
</p>
</div>
</div>
