org/posts/c-programming.org
*** Q188: Why document undefined/implementation-defined assumptions?
It simplifies porting, code review, audits, and future maintenance.

*** Q189: What is contract-based comment style for C APIs?
Document preconditions, ownership, lifetime, thread safety, errors, side effects, and postconditions.

*** Q190: How should C libraries expose errors?
Return clear status codes; optionally provide detail via out-params, thread-local context, or errno-style mechanisms.

*** Q191: What is fail-fast vs fail-safe trade-off?
- Fail-fast: detect and stop quickly; great for debugging and invariants.
- Fail-safe: continue safely/degraded for resilience.
Choose based on domain risk and requirements.

*** Q192: How prevent API misuse at compile time?
Use opaque types, ~const~, restrictive signatures, dedicated handle types, and minimal mutable surface.

*** Q193: What is strict weak ordering relevance in C sorting callbacks?
~qsort~ comparators must be consistent/transitive.
Violations can make sort results undefined or unstable.

*** Q194: Why can qsort comparator overflow bug happen?
#+begin_src c
return *(int*)a - *(int*)b; // can overflow
#+end_src
Subtraction may overflow signed int, violating comparator contract.

*** Q195: Safer qsort comparator pattern
#+begin_src c
int cmp_int(const void *pa, const void *pb) {
    int a = *(const int*)pa, b = *(const int*)pb;
    return (a > b) - (a < b);
}
#+end_src

*** Q196: What is C23 in practical terms for teams today?
Newest standard with quality-of-life improvements, but compiler/library support is uneven.
Adopt incrementally per toolchain matrix.

*** Q197: Should production code rely immediately on newest standard features?
Only when your supported compilers/platforms fully support them.
Otherwise gate features with checks and compatibility layers.

*** Q198: What is migration strategy between C standards?
Improve warning hygiene, remove UB-prone idioms, strengthen tests, then enable newer standard gradually in CI and release flows.

*** Q199: What is an expert code review checklist for C?
Bounds checks, ownership/lifetime, UB hazards, integer math, concurrency, API contracts, error handling, portability, test coverage.

*** Q200: What distinguishes expert C code from merely working C code?
Expert C remains correct under optimization, explicit about contracts/lifetimes, portable, secure-minded, testable, and maintainable over time.

* Bonus Practice Prompts

*** Prompt 1
Explain why this code is wrong and fix it:
#+begin_src c
char *p = malloc(4);
strcpy(p, "blue");
#+end_src
Issue: needs 5 bytes including NUL terminator; overflow occurs.
One fix:
#+begin_src c
char *p = malloc(5);
if (p) strcpy(p, "blue");
#+end_src

*** Prompt 2
Write a safe function to copy a string into a fixed-size buffer.
#+begin_src c
#include <stddef.h>
#include <string.h>

int copy_cstr(char *dst, size_t dstsz, const char *src) {
    if (!dst || !src || dstsz == 0) return -1;
    size_t n = strlen(src);
    if (n >= dstsz) {
        memcpy(dst, src, dstsz - 1);
        dst[dstsz - 1] = '\0';
        return 1; // truncated
    }
    memcpy(dst, src, n + 1);
    return 0; // full copy
}
#+end_src

*** Prompt 3
Implement a generic callback-based iterator over an integer array.
#+begin_src c
#include <stddef.h>

typedef void (*int_cb)(int value, void *ctx);

void for_each_int(const int *a, size_t n, int_cb cb, void *ctx) {
    if (!a || !cb) return;
    for (size_t i = 0; i < n; i++) cb(a[i], ctx);
}
#+end_src

*** Prompt 4
Refactor a macro into a static inline function and explain trade-offs.
Macro:
#+begin_src c
#define MAX(a,b) ((a) > (b) ? (a) : (b))
#+end_src
Refactor:
#+begin_src c
static inline int max_int(int a, int b) { return a > b ? a : b; }
#+end_src
Trade-off: function is type-safe and avoids double-evaluation side effects, but macro is generic unless you add overload-like wrappers.

