public/posts/c-programming.html
<div id="outline-container-org19d0a0a" class="outline-4">
<h4 id="org19d0a0a">Q188: Why document undefined/implementation-defined assumptions?</h4>
<div class="outline-text-4" id="text-org19d0a0a">
<p>
It simplifies porting, code review, audits, and future maintenance.
</p>
</div>
</div>
<div id="outline-container-orgd966de1" class="outline-4">
<h4 id="orgd966de1">Q189: What is contract-based comment style for C APIs?</h4>
<div class="outline-text-4" id="text-orgd966de1">
<p>
Document preconditions, ownership, lifetime, thread safety, errors, side effects, and postconditions.
</p>
</div>
</div>
<div id="outline-container-orgcbfbe46" class="outline-4">
<h4 id="orgcbfbe46">Q190: How should C libraries expose errors?</h4>
<div class="outline-text-4" id="text-orgcbfbe46">
<p>
Return clear status codes; optionally provide detail via out-params, thread-local context, or errno-style mechanisms.
</p>
</div>
</div>
<div id="outline-container-orgcb734f8" class="outline-4">
<h4 id="orgcb734f8">Q191: What is fail-fast vs fail-safe trade-off?</h4>
<div class="outline-text-4" id="text-orgcb734f8">
<ul class="org-ul">
<li>Fail-fast: detect and stop quickly; great for debugging and invariants.</li>
<li>Fail-safe: continue safely/degraded for resilience.</li>
</ul>
<p>
Choose based on domain risk and requirements.
</p>
</div>
</div>
<div id="outline-container-orgbb578c1" class="outline-4">
<h4 id="orgbb578c1">Q192: How prevent API misuse at compile time?</h4>
<div class="outline-text-4" id="text-orgbb578c1">
<p>
Use opaque types, <code>const</code>, restrictive signatures, dedicated handle types, and minimal mutable surface.
</p>
</div>
</div>
<div id="outline-container-orgf709bd0" class="outline-4">
<h4 id="orgf709bd0">Q193: What is strict weak ordering relevance in C sorting callbacks?</h4>
<div class="outline-text-4" id="text-orgf709bd0">
<p>
<code>qsort</code> comparators must be consistent/transitive.
Violations can make sort results undefined or unstable.
</p>
</div>
</div>
<div id="outline-container-org9349d88" class="outline-4">
<h4 id="org9349d88">Q194: Why can qsort comparator overflow bug happen?</h4>
<div class="outline-text-4" id="text-org9349d88">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">return</span> *(<span style="font-weight: bold; text-decoration: underline;">int</span>*)a - *(<span style="font-weight: bold; text-decoration: underline;">int</span>*)b; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">can overflow</span>
</pre>
</div>
<p>
Subtraction may overflow signed int, violating comparator contract.
</p>
</div>
</div>
<div id="outline-container-orgedf62ab" class="outline-4">
<h4 id="orgedf62ab">Q195: Safer qsort comparator pattern</h4>
<div class="outline-text-4" id="text-orgedf62ab">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">cmp_int</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">void</span> *<span style="font-weight: bold; font-style: italic;">pa</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">void</span> *<span style="font-weight: bold; font-style: italic;">pb</span>) {
    <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span> = *(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">int</span>*)pa, <span style="font-weight: bold; font-style: italic;">b</span> = *(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">int</span>*)pb;
    <span style="font-weight: bold;">return</span> (a &gt; b) - (a &lt; b);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc73518" class="outline-4">
<h4 id="orgdc73518">Q196: What is C23 in practical terms for teams today?</h4>
<div class="outline-text-4" id="text-orgdc73518">
<p>
Newest standard with quality-of-life improvements, but compiler/library support is uneven.
Adopt incrementally per toolchain matrix.
</p>
</div>
</div>
<div id="outline-container-orga55dc53" class="outline-4">
<h4 id="orga55dc53">Q197: Should production code rely immediately on newest standard features?</h4>
<div class="outline-text-4" id="text-orga55dc53">
<p>
Only when your supported compilers/platforms fully support them.
Otherwise gate features with checks and compatibility layers.
</p>
</div>
</div>
<div id="outline-container-org1c09fd9" class="outline-4">
<h4 id="org1c09fd9">Q198: What is migration strategy between C standards?</h4>
<div class="outline-text-4" id="text-org1c09fd9">
<p>
Improve warning hygiene, remove UB-prone idioms, strengthen tests, then enable newer standard gradually in CI and release flows.
</p>
</div>
</div>
<div id="outline-container-orgad8aa7d" class="outline-4">
<h4 id="orgad8aa7d">Q199: What is an expert code review checklist for C?</h4>
<div class="outline-text-4" id="text-orgad8aa7d">
<p>
Bounds checks, ownership/lifetime, UB hazards, integer math, concurrency, API contracts, error handling, portability, test coverage.
</p>
</div>
</div>
<div id="outline-container-org00f2c31" class="outline-4">
<h4 id="org00f2c31">Q200: What distinguishes expert C code from merely working C code?</h4>
<div class="outline-text-4" id="text-org00f2c31">
<p>
Expert C remains correct under optimization, explicit about contracts/lifetimes, portable, secure-minded, testable, and maintainable over time.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org60d605a" class="outline-2">
<h2 id="org60d605a">Bonus Practice Prompts</h2>
<div class="outline-text-2" id="text-org60d605a">
</div>
<div id="outline-container-orgcf438e4" class="outline-4">
<h4 id="orgcf438e4">Prompt 1</h4>
<div class="outline-text-4" id="text-orgcf438e4">
<p>
Explain why this code is wrong and fix it:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">p</span> = malloc(4);
<span style="font-weight: bold;">strcpy</span>(p, <span style="font-style: italic;">"blue"</span>);
</pre>
</div>
<p>
Issue: needs 5 bytes including NUL terminator; overflow occurs.
One fix:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">p</span> = malloc(5);
<span style="font-weight: bold;">if</span> (p) <span style="font-weight: bold;">strcpy</span>(p, <span style="font-style: italic;">"blue"</span>);
</pre>
</div>
</div>
</div>
<div id="outline-container-org44d7a82" class="outline-4">
<h4 id="org44d7a82">Prompt 2</h4>
<div class="outline-text-4" id="text-org44d7a82">
<p>
Write a safe function to copy a string into a fixed-size buffer.
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stddef.h&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;string.h&gt;</span>

<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">copy_cstr</span>(<span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">dst</span>, <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">dstsz</span>, <span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">char</span> *<span style="font-weight: bold; font-style: italic;">src</span>) {
    <span style="font-weight: bold;">if</span> (!dst || !src || dstsz == 0) <span style="font-weight: bold;">return</span> -1;
    <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">n</span> = strlen(src);
    <span style="font-weight: bold;">if</span> (n &gt;= dstsz) {
        memcpy(dst, src, dstsz - 1);
        dst[dstsz - 1] = <span style="font-style: italic;">'\0'</span>;
        <span style="font-weight: bold;">return</span> 1; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">truncated
</span>    }
    memcpy(dst, src, n + 1);
    <span style="font-weight: bold;">return</span> 0; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">full copy
</span>}
</pre>
</div>
</div>
</div>
<div id="outline-container-org0d46a8b" class="outline-4">
<h4 id="org0d46a8b">Prompt 3</h4>
<div class="outline-text-4" id="text-org0d46a8b">
<p>
Implement a generic callback-based iterator over an integer array.
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stddef.h&gt;</span>

<span style="font-weight: bold;">typedef</span> <span style="font-weight: bold; text-decoration: underline;">void</span> (*<span style="font-weight: bold; text-decoration: underline;">int_cb</span>)(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">value</span>, <span style="font-weight: bold; text-decoration: underline;">void</span> *<span style="font-weight: bold; font-style: italic;">ctx</span>);

<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">for_each_int</span>(<span style="font-weight: bold;">const</span> <span style="font-weight: bold; text-decoration: underline;">int</span> *<span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">n</span>, <span style="font-weight: bold; text-decoration: underline;">int_cb</span> <span style="font-weight: bold; font-style: italic;">cb</span>, <span style="font-weight: bold; text-decoration: underline;">void</span> *<span style="font-weight: bold; font-style: italic;">ctx</span>) {
    <span style="font-weight: bold;">if</span> (!a || !cb) <span style="font-weight: bold;">return</span>;
    <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">size_t</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; n; i++) cb(a[i], ctx);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbf5a20e" class="outline-4">
<h4 id="orgbf5a20e">Prompt 4</h4>
<div class="outline-text-4" id="text-orgbf5a20e">
<p>
Refactor a macro into a static inline function and explain trade-offs.
Macro:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">#define</span> <span style="font-weight: bold;">MAX</span>(<span style="font-weight: bold; font-style: italic;">a</span>,<span style="font-weight: bold; font-style: italic;">b</span>) ((a) &gt; (b) ? (a) : (b))
</pre>
</div>
<p>
Refactor:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">static</span> <span style="font-weight: bold;">inline</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">max_int</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">a</span>, <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">b</span>) { <span style="font-weight: bold;">return</span> a &gt; b ? a : b; }
</pre>
</div>
<p>
Trade-off: function is type-safe and avoids double-evaluation side effects, but macro is generic unless you add overload-like wrappers.
</p>
</div>
</div>
