org/posts/c-programming.org
*** Prompt 5
Demonstrate lock-free counter increment with C11 atomics and explain chosen memory order.
#+begin_src c
#include <stdatomic.h>

atomic_ulong counter = 0;

void hit(void) {
    atomic_fetch_add_explicit(&counter, 1u, memory_order_relaxed);
}
#+end_src
~memory_order_relaxed~ is appropriate when only atomicity of the counter matters, not synchronization of other data.

-----

#+INCLUDE: "../footer.org"
