public/posts/c-programming.html
<div id="outline-container-org32650b2" class="outline-4">
<h4 id="org32650b2">Prompt 5</h4>
<div class="outline-text-4" id="text-org32650b2">
<p>
Demonstrate lock-free counter increment with C11 atomics and explain chosen memory order.
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;stdatomic.h&gt;</span>

<span style="font-weight: bold; text-decoration: underline;">atomic_ulong</span> <span style="font-weight: bold; font-style: italic;">counter</span> = 0;

<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">hit</span>(<span style="font-weight: bold; text-decoration: underline;">void</span>) {
    atomic_fetch_add_explicit(&amp;counter, 1u, memory_order_relaxed);
}
</pre>
</div>
<p>
<code>memory_order_relaxed</code> is appropriate when only atomicity of the counter matters, not synchronization of other data.
</p>

<hr>

<div class="site-footer">
    <ul class="social-icons">
        <li><a href="https://github.com/bdostumski" rel="nofollow noopener noreferrer"><i class="fab fa-fw fa-github" aria-hidden="true"></i> GitHub</a></li>
        <li><a href="https://www.linkedin.com/in/borislav-dostumski/" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> LinkedIn</a></li>
        <li><a href="https://www.youtube.com/@borislavdostumski6006" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> YouTube</a></li>
    </ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
